String rawDataNaMapTools = '''[
{
"State": "اردبيل",
"City": "اردبيل",
"phi": "38.24974442",
" lambda": "48.29428482"
},
{
"State": "اردبيل",
"City": "اصلاندوز",
"phi": "39.44260406",
" lambda": "47.41002274"
},
{
"State": "اردبيل",
"City": "آبي بيگلو",
"phi": "38.28489685",
" lambda": "48.55250549"
},
{
"State": "اردبيل",
"City": "بيله سوار",
"phi": "39.37607956",
" lambda": "48.34270859"
},
{
"State": "اردبيل",
"City": "پارس آباد",
"phi": "39.64579391",
" lambda": "47.90995026"
},
{
"State": "اردبيل",
"City": "تازه كند",
"phi": "39.57558823",
" lambda": "48.0163765"
},
{
"State": "اردبيل",
"City": "تازه كندانگوت",
"phi": "39.04096603",
" lambda": "47.74365234"
},
{
"State": "اردبيل",
"City": "جعفرآباد",
"phi": "39.43317795",
" lambda": "48.09788132"
},
{
"State": "اردبيل",
"City": "خلخال",
"phi": "37.62075043",
" lambda": "48.52736664"
},
{
"State": "اردبيل",
"City": "رضي",
"phi": "38.62902069",
" lambda": "48.09450912"
},
{
"State": "اردبيل",
"City": "سرعين",
"phi": "38.13766861",
" lambda": "48.07623291"
},
{
"State": "اردبيل",
"City": "عنبران",
"phi": "38.48768997",
" lambda": "48.43514252"
},
{
"State": "اردبيل",
"City": "فخرآباد",
"phi": "38.52298737",
" lambda": "47.86167145"
},
{
"State": "اردبيل",
"City": "كلور",
"phi": "37.38945389",
" lambda": "48.72290421"
},
{
"State": "اردبيل",
"City": "كوراييم",
"phi": "37.95056915",
" lambda": "48.23551559"
},
{
"State": "اردبيل",
"City": "گرمي",
"phi": "39.01218796",
" lambda": "48.08360291"
},
{
"State": "اردبيل",
"City": "گيوي",
"phi": "37.68416214",
" lambda": "48.33966827"
},
{
"State": "اردبيل",
"City": "لاهرود",
"phi": "38.50733566",
" lambda": "47.83047867"
},
{
"State": "اردبيل",
"City": "مرادلو",
"phi": "38.74676132",
" lambda": "47.74628448"
},
{
"State": "اردبيل",
"City": "مشگين شهر",
"phi": "38.39718628",
" lambda": "47.67258072"
},
{
"State": "اردبيل",
"City": "نمين",
"phi": "38.42364883",
" lambda": "48.4808197"
},
{
"State": "اردبيل",
"City": "نير",
"phi": "38.03521729",
" lambda": "48.00739288"
},
{
"State": "اردبيل",
"City": "هشتجين",
"phi": "37.36382675",
" lambda": "48.32458496"
},
{
"State": "اردبيل",
"City": "هير",
"phi": "38.07535553",
" lambda": "48.4979744"
},
{
"State": "اصفهان",
"City": "ابريشم",
"phi": "32.5561142",
" lambda": "51.57363129"
},
{
"State": "اصفهان",
"City": "ابوزيدآباد",
"phi": "33.90413284",
" lambda": "51.76800156"
},
{
"State": "اصفهان",
"City": "اردستان",
"phi": "33.35657883",
" lambda": "52.37818527"
},
{
"State": "اصفهان",
"City": "اژيه",
"phi": "32.44017029",
" lambda": "52.3795166"
},
{
"State": "اصفهان",
"City": "اصفهان",
"phi": "32.57763672",
" lambda": "51.6590538"
},
{
"State": "اصفهان",
"City": "افوس",
"phi": "33.0241394",
" lambda": "50.09297943"
},
{
"State": "اصفهان",
"City": "انارك",
"phi": "33.30680084",
" lambda": "53.69702911"
},
{
"State": "اصفهان",
"City": "ايمانشهر",
"phi": "32.47034836",
" lambda": "51.46138382"
},
{
"State": "اصفهان",
"City": "آران وبيدگل",
"phi": "34.05819702",
" lambda": "51.48248672"
},
{
"State": "اصفهان",
"City": "بادرود",
"phi": "33.68975067",
" lambda": "52.0112648"
},
{
"State": "اصفهان",
"City": "باغ بهادران",
"phi": "32.37582016",
" lambda": "51.19124222"
},
{
"State": "اصفهان",
"City": "بافران",
"phi": "32.83668137",
" lambda": "53.14214325"
},
{
"State": "اصفهان",
"City": "برزك",
"phi": "33.7783165",
" lambda": "51.23015213"
},
{
"State": "اصفهان",
"City": "برف انبار",
"phi": "32.9958725",
" lambda": "50.19388199"
},
{
"State": "اصفهان",
"City": "بوئين ومياندشت",
"phi": "33.08044434",
" lambda": "50.15873337"
},
{
"State": "اصفهان",
"City": "بهاران شهر",
"phi": "32.51564407",
" lambda": "51.54144287"
},
{
"State": "اصفهان",
"City": "بهارستان",
"phi": "32.48651123",
" lambda": "51.77891159"
},
{
"State": "اصفهان",
"City": "پيربكران",
"phi": "32.46557617",
" lambda": "51.55596161"
},
{
"State": "اصفهان",
"City": "تودشك",
"phi": "32.72826767",
" lambda": "52.6791153"
},
{
"State": "اصفهان",
"City": "تيران",
"phi": "32.70440292",
" lambda": "51.15317917"
},
{
"State": "اصفهان",
"City": "جندق",
"phi": "34.04131317",
" lambda": "54.41446686"
},
{
"State": "اصفهان",
"City": "جوزدان",
"phi": "32.55489731",
" lambda": "51.3718605"
},
{
"State": "اصفهان",
"City": "جوشقان وكامو",
"phi": "33.59946823",
" lambda": "51.22826385"
},
{
"State": "اصفهان",
"City": "چادگان",
"phi": "32.77155685",
" lambda": "50.62685776"
},
{
"State": "اصفهان",
"City": "چرمهين",
"phi": "32.33835983",
" lambda": "51.19548798"
},
{
"State": "اصفهان",
"City": "چمگردان",
"phi": "32.3935051",
" lambda": "51.33535004"
},
{
"State": "اصفهان",
"City": "حبيب آباد",
"phi": "32.82188797",
" lambda": "51.77587128"
},
{
"State": "اصفهان",
"City": "حسن آباد",
"phi": "32.13663483",
" lambda": "52.62354279"
},
{
"State": "اصفهان",
"City": "حنا",
"phi": "31.19758415",
" lambda": "51.7256813"
},
{
"State": "اصفهان",
"City": "خالدآباد",
"phi": "33.70183563",
" lambda": "51.98164368"
},
{
"State": "اصفهان",
"City": "خميني شهر",
"phi": "32.68333054",
" lambda": "51.53359604"
},
{
"State": "اصفهان",
"City": "خوانسار",
"phi": "33.21422958",
" lambda": "50.31887054"
},
{
"State": "اصفهان",
"City": "خور",
"phi": "33.77181625",
" lambda": "55.08384323"
},
{
"State": "اصفهان",
"City": "خوراسگان",
"phi": "32.65510178",
" lambda": "51.75954819"
},
{
"State": "اصفهان",
"City": "خورزوق",
"phi": "32.77672195",
" lambda": "51.64983749"
},
{
"State": "اصفهان",
"City": "داران",
"phi": "32.9862175",
" lambda": "50.40913773"
},
{
"State": "اصفهان",
"City": "دامنه",
"phi": "33.01579285",
" lambda": "50.48777008"
},
{
"State": "اصفهان",
"City": "درچه پياز",
"phi": "32.60448074",
" lambda": "51.5477066"
},
{
"State": "اصفهان",
"City": "دستگرد",
"phi": "32.80204773",
" lambda": "51.66571426"
},
{
"State": "اصفهان",
"City": "دولت آباد",
"phi": "32.80472946",
" lambda": "51.69356155"
},
{
"State": "اصفهان",
"City": "دهاقان",
"phi": "31.93313026",
" lambda": "51.65417862"
},
{
"State": "اصفهان",
"City": "دهق",
"phi": "33.10338593",
" lambda": "50.95917511"
},
{
"State": "اصفهان",
"City": "ديزيچه",
"phi": "32.37792969",
" lambda": "51.50416183"
},
{
"State": "اصفهان",
"City": "رزوه",
"phi": "32.83512878",
" lambda": "50.56934357"
},
{
"State": "اصفهان",
"City": "رضوانشهر",
"phi": "32.69974136",
" lambda": "51.10388184"
},
{
"State": "اصفهان",
"City": "زاينده رود",
"phi": "32.37821579",
" lambda": "51.27326202"
},
{
"State": "اصفهان",
"City": "زرين شهر",
"phi": "32.39413071",
" lambda": "51.38589478"
},
{
"State": "اصفهان",
"City": "زواره",
"phi": "33.44786072",
" lambda": "52.48666382"
},
{
"State": "اصفهان",
"City": "زيباشهر",
"phi": "32.37941742",
" lambda": "51.56482315"
},
{
"State": "اصفهان",
"City": "سده لنجان",
"phi": "32.37739182",
" lambda": "51.31890488"
},
{
"State": "اصفهان",
"City": "سفيدشهر",
"phi": "34.12306213",
" lambda": "51.35150146"
},
{
"State": "اصفهان",
"City": "سگزي",
"phi": "32.66856384",
" lambda": "52.13046646"
},
{
"State": "اصفهان",
"City": "سميرم",
"phi": "31.41455269",
" lambda": "51.5718689"
},
{
"State": "اصفهان",
"City": "شاپورآباد",
"phi": "32.84542084",
" lambda": "51.74332047"
},
{
"State": "اصفهان",
"City": "شاهين شهر",
"phi": "32.86431885",
" lambda": "51.55467606"
},
{
"State": "اصفهان",
"City": "شهرضا",
"phi": "31.97665977",
" lambda": "51.84942627"
},
{
"State": "اصفهان",
"City": "طالخونچه",
"phi": "32.26208496",
" lambda": "51.56427765"
},
{
"State": "اصفهان",
"City": "عسگران",
"phi": "32.86352539",
" lambda": "50.85219955"
},
{
"State": "اصفهان",
"City": "علويچه",
"phi": "33.05480194",
" lambda": "51.08145905"
},
{
"State": "اصفهان",
"City": "فرخي",
"phi": "33.8445816",
" lambda": "54.94688034"
},
{
"State": "اصفهان",
"City": "فريدونشهر",
"phi": "32.93998718",
" lambda": "50.13938522"
},
{
"State": "اصفهان",
"City": "فلاورجان",
"phi": "32.55626678",
" lambda": "51.50629044"
},
{
"State": "اصفهان",
"City": "فولادشهر",
"phi": "32.48953247",
" lambda": "51.40736771"
},
{
"State": "اصفهان",
"City": "قمصر",
"phi": "33.75201035",
" lambda": "51.4306488"
},
{
"State": "اصفهان",
"City": "قهجاورستان",
"phi": "32.70313644",
" lambda": "51.83500671"
},
{
"State": "اصفهان",
"City": "قهدريجان",
"phi": "32.57383728",
" lambda": "51.45584869"
},
{
"State": "اصفهان",
"City": "كاشان",
"phi": "33.98339462",
" lambda": "51.43208313"
},
{
"State": "اصفهان",
"City": "كركوند",
"phi": "32.3462944",
" lambda": "51.43723679"
},
{
"State": "اصفهان",
"City": "كليشادوسودرجان",
"phi": "32.54153824",
" lambda": "51.5358963"
},
{
"State": "اصفهان",
"City": "كمشچه",
"phi": "32.90576935",
" lambda": "51.80904007"
},
{
"State": "اصفهان",
"City": "كمه",
"phi": "31.06146622",
" lambda": "51.59358215"
},
{
"State": "اصفهان",
"City": "كوشك",
"phi": "32.6400795",
" lambda": "51.50010681"
},
{
"State": "اصفهان",
"City": "كوهپايه",
"phi": "32.71511078",
" lambda": "52.43251801"
},
{
"State": "اصفهان",
"City": "كهريزسنگ",
"phi": "32.62624741",
" lambda": "51.47711563"
},
{
"State": "اصفهان",
"City": "گرگاب",
"phi": "32.86576843",
" lambda": "51.59765244"
},
{
"State": "اصفهان",
"City": "گزبرخوار",
"phi": "32.80460739",
" lambda": "51.61882782"
},
{
"State": "اصفهان",
"City": "گلپايگان",
"phi": "33.45095062",
" lambda": "50.28336334"
},
{
"State": "اصفهان",
"City": "گلدشت",
"phi": "32.6299057",
" lambda": "51.44271851"
},
{
"State": "اصفهان",
"City": "گلشن",
"phi": "31.9292202",
" lambda": "51.75250626"
},
{
"State": "اصفهان",
"City": "گلشهر",
"phi": "33.50588226",
" lambda": "50.46561432"
},
{
"State": "اصفهان",
"City": "گوگد",
"phi": "33.47344589",
" lambda": "50.34531403"
},
{
"State": "اصفهان",
"City": "لاي بيد",
"phi": "33.4586525",
" lambda": "50.69414902"
},
{
"State": "اصفهان",
"City": "مباركه",
"phi": "32.34177399",
" lambda": "51.50068283"
},
{
"State": "اصفهان",
"City": "محمدآباد",
"phi": "32.31945419",
" lambda": "52.10391235"
},
{
"State": "اصفهان",
"City": "مشكات",
"phi": "34.17534637",
" lambda": "51.26825714"
},
{
"State": "اصفهان",
"City": "منظريه",
"phi": "31.94329071",
" lambda": "51.87212753"
},
{
"State": "اصفهان",
"City": "مهاباد",
"phi": "33.52765656",
" lambda": "52.21732712"
},
{
"State": "اصفهان",
"City": "ميمه",
"phi": "33.44674301",
" lambda": "51.17034531"
},
{
"State": "اصفهان",
"City": "نائين",
"phi": "32.86044693",
" lambda": "53.09561539"
},
{
"State": "اصفهان",
"City": "نجف آباد",
"phi": "32.63153458",
" lambda": "51.35058975"
},
{
"State": "اصفهان",
"City": "نصرآباد",
"phi": "32.27835464",
" lambda": "52.06196976"
},
{
"State": "اصفهان",
"City": "نطنز",
"phi": "33.50468063",
" lambda": "51.9190712"
},
{
"State": "اصفهان",
"City": "نوش آباد",
"phi": "34.08082581",
" lambda": "51.43794632"
},
{
"State": "اصفهان",
"City": "نياسر",
"phi": "33.97245026",
" lambda": "51.14891052"
},
{
"State": "اصفهان",
"City": "نيك آباد",
"phi": "32.30278397",
" lambda": "52.20520782"
},
{
"State": "اصفهان",
"City": "ورزنه",
"phi": "32.4203186",
" lambda": "52.65061188"
},
{
"State": "اصفهان",
"City": "ورنامخواست",
"phi": "32.35495758",
" lambda": "51.38011932"
},
{
"State": "اصفهان",
"City": "وزوان",
"phi": "33.41989136",
" lambda": "51.18333817"
},
{
"State": "اصفهان",
"City": "ونك",
"phi": "31.52824211",
" lambda": "51.32647324"
},
{
"State": "اصفهان",
"City": "هرند",
"phi": "32.56386185",
" lambda": "52.43729019"
},
{
"State": "البرز",
"City": "اشتهارد",
"phi": "35.7245903",
" lambda": "50.3614769"
},
{
"State": "البرز",
"City": "آسارا",
"phi": "36.03144836",
" lambda": "51.1738739"
},
{
"State": "البرز",
"City": "تنكمان",
"phi": "35.88940811",
" lambda": "50.61488342"
},
{
"State": "البرز",
"City": "چهارباغ",
"phi": "35.83815384",
" lambda": "50.8479805"
},
{
"State": "البرز",
"City": "سيف آباد",
"phi": "35.91147995",
" lambda": "50.77053833"
},
{
"State": "البرز",
"City": "شهرجديدهشتگرد",
"phi": "35.98429489",
" lambda": "50.74120331"
},
{
"State": "البرز",
"City": "طالقان",
"phi": "36.17299652",
" lambda": "50.76848984"
},
{
"State": "البرز",
"City": "كرج",
"phi": "35.72472",
" lambda": "50.95276642"
},
{
"State": "البرز",
"City": "كمال شهر",
"phi": "35.84603882",
" lambda": "50.88404846"
},
{
"State": "البرز",
"City": "كوهسار",
"phi": "35.9556694",
" lambda": "50.79353333"
},
{
"State": "البرز",
"City": "گرمدره",
"phi": "35.74454117",
" lambda": "51.06885529"
},
{
"State": "البرز",
"City": "ماهدشت",
"phi": "35.72756195",
" lambda": "50.80612946"
},
{
"State": "البرز",
"City": "محمدشهر",
"phi": "35.73664474",
" lambda": "50.89955139"
},
{
"State": "البرز",
"City": "مشكين دشت",
"phi": "35.74838638",
" lambda": "50.94078064"
},
{
"State": "البرز",
"City": "نظرآباد",
"phi": "35.95195007",
" lambda": "50.60453415"
},
{
"State": "البرز",
"City": "هشتگرد",
"phi": "35.95068359",
" lambda": "50.68386078"
},
{
"State": "ايلام",
"City": "اركواز",
"phi": "33.38710785",
" lambda": "46.59772491"
},
{
"State": "ايلام",
"City": "ايلام",
"phi": "33.57505417",
" lambda": "46.41641617"
},
{
"State": "ايلام",
"City": "ايوان",
"phi": "33.82935333",
" lambda": "46.30612946"
},
{
"State": "ايلام",
"City": "آبدانان",
"phi": "32.98835373",
" lambda": "47.42409515"
},
{
"State": "ايلام",
"City": "آسمان آباد",
"phi": "33.84938431",
" lambda": "46.46562576"
},
{
"State": "ايلام",
"City": "بدره",
"phi": "33.30717087",
" lambda": "47.03833008"
},
{
"State": "ايلام",
"City": "پهله",
"phi": "33.01145554",
" lambda": "46.88355637"
},
{
"State": "ايلام",
"City": "توحيد",
"phi": "33.7268219",
" lambda": "47.06829453"
},
{
"State": "ايلام",
"City": "چوار",
"phi": "33.69190979",
" lambda": "46.29715347"
},
{
"State": "ايلام",
"City": "دره شهر",
"phi": "33.14948654",
" lambda": "47.38166046"
},
{
"State": "ايلام",
"City": "دلگشا",
"phi": "33.40571213",
" lambda": "46.59428787"
},
{
"State": "ايلام",
"City": "دهلران",
"phi": "32.69020081",
" lambda": "47.27085495"
},
{
"State": "ايلام",
"City": "زرنه",
"phi": "33.92621231",
" lambda": "46.1867218"
},
{
"State": "ايلام",
"City": "سراب باغ",
"phi": "32.8966713",
" lambda": "47.57263184"
},
{
"State": "ايلام",
"City": "سرابله",
"phi": "33.76822662",
" lambda": "46.56136703"
},
{
"State": "ايلام",
"City": "صالح آباد",
"phi": "33.46877289",
" lambda": "46.19106674"
},
{
"State": "ايلام",
"City": "لومار",
"phi": "33.56718445",
" lambda": "46.81135559"
},
{
"State": "ايلام",
"City": "مورموري",
"phi": "32.72631836",
" lambda": "47.67509842"
},
{
"State": "ايلام",
"City": "موسيان",
"phi": "32.52018356",
" lambda": "47.37707138"
},
{
"State": "ايلام",
"City": "مهران",
"phi": "33.12202835",
" lambda": "46.17288971"
},
{
"State": "ايلام",
"City": "ميمه ",
"phi": "33.22662354",
" lambda": "46.91864777"
},
{
"State": "آذربايجان شرقي",
"City": "اسكو",
"phi": "37.91778183",
" lambda": "46.12446976"
},
{
"State": "آذربايجان شرقي",
"City": "اهر",
"phi": "38.47453308",
" lambda": "47.07098389"
},
{
"State": "آذربايجان شرقي",
"City": "ايلخچي",
"phi": "37.93674088",
" lambda": "45.981987"
},
{
"State": "آذربايجان شرقي",
"City": "آبش احمد",
"phi": "39.04013824",
" lambda": "47.31736374"
},
{
"State": "آذربايجان شرقي",
"City": "آذرشهر",
"phi": "37.76617813",
" lambda": "45.97644806"
},
{
"State": "آذربايجان شرقي",
"City": "آقكند",
"phi": "37.25337219",
" lambda": "48.06547165"
},
{
"State": "آذربايجان شرقي",
"City": "باسمنج",
"phi": "37.99435425",
" lambda": "46.4747467"
},
{
"State": "آذربايجان شرقي",
"City": "بخشايش",
"phi": "38.1318512",
" lambda": "46.9474678"
},
{
"State": "آذربايجان شرقي",
"City": "بستان آباد",
"phi": "37.83699417",
" lambda": "46.83096313"
},
{
"State": "آذربايجان شرقي",
"City": "بناب",
"phi": "37.34558868",
" lambda": "46.06620026"
},
{
"State": "آذربايجان شرقي",
"City": "بناب جديد",
"phi": "38.42330551",
" lambda": "45.90700912"
},
{
"State": "آذربايجان شرقي",
"City": "تبريز",
"phi": "38.0792923",
" lambda": "46.28915024"
},
{
"State": "آذربايجان شرقي",
"City": "ترك",
"phi": "37.60768509",
" lambda": "47.76818848"
},
{
"State": "آذربايجان شرقي",
"City": "تركمانچاي",
"phi": "37.58044052",
" lambda": "47.39145279"
},
{
"State": "آذربايجان شرقي",
"City": "تسوج",
"phi": "38.31055069",
" lambda": "45.37041473"
},
{
"State": "آذربايجان شرقي",
"City": "تيكمه داش",
"phi": "37.72838974",
" lambda": "46.9458046"
},
{
"State": "آذربايجان شرقي",
"City": "جلفا",
"phi": "38.93476486",
" lambda": "45.63887024"
},
{
"State": "آذربايجان شرقي",
"City": "خاروانا",
"phi": "38.68300247",
" lambda": "46.16864014"
},
{
"State": "آذربايجان شرقي",
"City": "خامنه",
"phi": "38.19393921",
" lambda": "45.63295746"
},
{
"State": "آذربايجان شرقي",
"City": "خراجو",
"phi": "37.31164932",
" lambda": "46.53153229"
},
{
"State": "آذربايجان شرقي",
"City": "خسروشهر",
"phi": "37.95437241",
" lambda": "46.05068588"
},
{
"State": "آذربايجان شرقي",
"City": "خمارلو",
"phi": "39.14801025",
" lambda": "47.03475571"
},
{
"State": "آذربايجان شرقي",
"City": "خواجه",
"phi": "38.1546936",
" lambda": "46.58691025"
},
{
"State": "آذربايجان شرقي",
"City": "دوزدوزان",
"phi": "37.94933319",
" lambda": "47.1199646"
},
{
"State": "آذربايجان شرقي",
"City": "زرنق",
"phi": "38.09184265",
" lambda": "47.08170319"
},
{
"State": "آذربايجان شرقي",
"City": "زنوز",
"phi": "38.58799362",
" lambda": "45.83438873"
},
{
"State": "آذربايجان شرقي",
"City": "سراب",
"phi": "37.94099808",
" lambda": "47.53533173"
},
{
"State": "آذربايجان شرقي",
"City": "سردرود",
"phi": "38.03178024",
" lambda": "46.14791489"
},
{
"State": "آذربايجان شرقي",
"City": "سيس",
"phi": "38.19407654",
" lambda": "45.81408691"
},
{
"State": "آذربايجان شرقي",
"City": "سيه رود",
"phi": "38.86951828",
" lambda": "46.00170517"
},
{
"State": "آذربايجان شرقي",
"City": "شبستر",
"phi": "38.18050003",
" lambda": "45.70139313"
},
{
"State": "آذربايجان شرقي",
"City": "شربيان",
"phi": "37.88155365",
" lambda": "47.09996033"
},
{
"State": "آذربايجان شرقي",
"City": "شرفخانه",
"phi": "38.17783737",
" lambda": "45.49025726"
},
{
"State": "آذربايجان شرقي",
"City": "شندآباد",
"phi": "38.14213562",
" lambda": "45.62252045"
},
{
"State": "آذربايجان شرقي",
"City": "شهرجديدسهند",
"phi": "37.94509125",
" lambda": "46.12100983"
},
{
"State": "آذربايجان شرقي",
"City": "صوفيان",
"phi": "38.27862167",
" lambda": "45.98161697"
},
{
"State": "آذربايجان شرقي",
"City": "عجب شير",
"phi": "37.47710037",
" lambda": "45.89483261"
},
{
"State": "آذربايجان شرقي",
"City": "قره آغاج",
"phi": "37.1291008",
" lambda": "46.97224045"
},
{
"State": "آذربايجان شرقي",
"City": "كشكسراي",
"phi": "38.46005249",
" lambda": "45.56893539"
},
{
"State": "آذربايجان شرقي",
"City": "كلوانق",
"phi": "38.10124969",
" lambda": "46.99319077"
},
{
"State": "آذربايجان شرقي",
"City": "كليبر",
"phi": "38.86484909",
" lambda": "47.04078293"
},
{
"State": "آذربايجان شرقي",
"City": "كوزه كنان",
"phi": "38.18380356",
" lambda": "45.57749176"
},
{
"State": "آذربايجان شرقي",
"City": "گوگان",
"phi": "37.76913452",
" lambda": "45.90457153"
},
{
"State": "آذربايجان شرقي",
"City": "ليلان",
"phi": "37.00645065",
" lambda": "46.20556641"
},
{
"State": "آذربايجان شرقي",
"City": "مراغه",
"phi": "37.38603592",
" lambda": "46.23360443"
},
{
"State": "آذربايجان شرقي",
"City": "مرند",
"phi": "38.43193817",
" lambda": "45.77204514"
},
{
"State": "آذربايجان شرقي",
"City": "ملكان",
"phi": "37.14253235",
" lambda": "46.10037613"
},
{
"State": "آذربايجان شرقي",
"City": "ممقان",
"phi": "37.83863449",
" lambda": "45.97155762"
},
{
"State": "آذربايجان شرقي",
"City": "مهربان",
"phi": "38.08159256",
" lambda": "47.13167191"
},
{
"State": "آذربايجان شرقي",
"City": "ميانه",
"phi": "37.4207077",
" lambda": "47.71635056"
},
{
"State": "آذربايجان شرقي",
"City": "نظركهريزي",
"phi": "37.34731293",
" lambda": "46.76208496"
},
{
"State": "آذربايجان شرقي",
"City": "وايقان",
"phi": "38.1308403",
" lambda": "45.71278381"
},
{
"State": "آذربايجان شرقي",
"City": "ورزقان",
"phi": "38.50870514",
" lambda": "46.65034485"
},
{
"State": "آذربايجان شرقي",
"City": "هاديشهر",
"phi": "38.8384285",
" lambda": "45.66290665"
},
{
"State": "آذربايجان شرقي",
"City": "هريس",
"phi": "38.24962234",
" lambda": "47.11711884"
},
{
"State": "آذربايجان شرقي",
"City": "هشترود",
"phi": "37.4707756",
" lambda": "47.05966949"
},
{
"State": "آذربايجان شرقي",
"City": "هوراند",
"phi": "38.85718918",
" lambda": "47.36512756"
},
{
"State": "آذربايجان شرقي",
"City": "يامچي",
"phi": "38.52165985",
" lambda": "45.64025879"
},
{
"State": "آذربايجان غربي",
"City": "اروميه",
"phi": "37.53953934",
" lambda": "45.05765152"
},
{
"State": "آذربايجان غربي",
"City": "اشنويه",
"phi": "37.04021072",
" lambda": "45.10004425"
},
{
"State": "آذربايجان غربي",
"City": "ايواوغلي",
"phi": "38.71865463",
" lambda": "45.21141052"
},
{
"State": "آذربايجان غربي",
"City": "آواجيق",
"phi": "39.33173752",
" lambda": "44.1531105"
},
{
"State": "آذربايجان غربي",
"City": "باروق",
"phi": "36.9509697",
" lambda": "46.31997681"
},
{
"State": "آذربايجان غربي",
"City": "بازرگان",
"phi": "39.39423752",
" lambda": "44.38668823"
},
{
"State": "آذربايجان غربي",
"City": "بوكان",
"phi": "36.50798798",
" lambda": "46.20666122"
},
{
"State": "آذربايجان غربي",
"City": "پلدشت",
"phi": "39.3478508",
" lambda": "45.06837082"
},
{
"State": "آذربايجان غربي",
"City": "پيرانشهر",
"phi": "36.69393921",
" lambda": "45.14119339"
},
{
"State": "آذربايجان غربي",
"City": "تازه شهر",
"phi": "38.17576599",
" lambda": "44.69081116"
},
{
"State": "آذربايجان غربي",
"City": "تكاب",
"phi": "36.40422058",
" lambda": "47.11016083"
},
{
"State": "آذربايجان غربي",
"City": "چهاربرج",
"phi": "37.12577057",
" lambda": "45.97556305"
},
{
"State": "آذربايجان غربي",
"City": "خليفان",
"phi": "36.50708771",
" lambda": "45.79647446"
},
{
"State": "آذربايجان غربي",
"City": "خوي",
"phi": "38.52029419",
" lambda": "44.95465469"
},
{
"State": "آذربايجان غربي",
"City": "ديزج ديز",
"phi": "38.46089554",
" lambda": "45.02344513"
},
{
"State": "آذربايجان غربي",
"City": "ربط",
"phi": "36.21127319",
" lambda": "45.55174255"
},
{
"State": "آذربايجان غربي",
"City": "سردشت",
"phi": "36.15399551",
" lambda": "45.47911453"
},
{
"State": "آذربايجان غربي",
"City": "سرو",
"phi": "37.72273254",
" lambda": "44.65042877"
},
{
"State": "آذربايجان غربي",
"City": "سلماس",
"phi": "38.1987381",
" lambda": "44.76602936"
},
{
"State": "آذربايجان غربي",
"City": "سيلوانه",
"phi": "37.42242813",
" lambda": "44.85132217"
},
{
"State": "آذربايجان غربي",
"City": "سيمينه",
"phi": "36.72569656",
" lambda": "46.15306854"
},
{
"State": "آذربايجان غربي",
"City": "سيه چشمه",
"phi": "39.06917953",
" lambda": "44.3874588"
},
{
"State": "آذربايجان غربي",
"City": "شاهين دژ",
"phi": "36.67921448",
" lambda": "46.56646347"
},
{
"State": "آذربايجان غربي",
"City": "شوط",
"phi": "39.21812439",
" lambda": "44.77112198"
},
{
"State": "آذربايجان غربي",
"City": "فيرورق",
"phi": "38.57778168",
" lambda": "44.8367157"
},
{
"State": "آذربايجان غربي",
"City": "قره ضياءالدين",
"phi": "38.88854218",
" lambda": "45.02517319"
},
{
"State": "آذربايجان غربي",
"City": "قطور",
"phi": "38.47347641",
" lambda": "44.40570068"
},
{
"State": "آذربايجان غربي",
"City": "قوشچي",
"phi": "37.99120712",
" lambda": "45.03787613"
},
{
"State": "آذربايجان غربي",
"City": "كشاورز",
"phi": "36.83474731",
" lambda": "46.35843277"
},
{
"State": "آذربايجان غربي",
"City": "گردكشانه",
"phi": "36.81188965",
" lambda": "45.27393723"
},
{
"State": "آذربايجان غربي",
"City": "ماكو",
"phi": "39.2921524",
" lambda": "44.49243546"
},
{
"State": "آذربايجان غربي",
"City": "محمديار",
"phi": "36.98139954",
" lambda": "45.5221405"
},
{
"State": "آذربايجان غربي",
"City": "محمودآباد",
"phi": "36.71187592",
" lambda": "46.51900864"
},
{
"State": "آذربايجان غربي",
"City": "مهاباد ",
"phi": "36.77022171",
" lambda": "45.72841263"
},
{
"State": "آذربايجان غربي",
"City": "مياندوآب",
"phi": "36.96496201",
" lambda": "46.1059494"
},
{
"State": "آذربايجان غربي",
"City": "ميرآباد",
"phi": "36.4030838",
" lambda": "45.37486649"
},
{
"State": "آذربايجان غربي",
"City": "نالوس",
"phi": "36.98450851",
" lambda": "45.1431427"
},
{
"State": "آذربايجان غربي",
"City": "نقده",
"phi": "36.9533844",
" lambda": "45.38890457"
},
{
"State": "آذربايجان غربي",
"City": "نوشين",
"phi": "37.73433685",
" lambda": "45.05229187"
},
{
"State": "بوشهر",
"City": "امام حسن",
"phi": "29.83965492",
" lambda": "50.2638855"
},
{
"State": "بوشهر",
"City": "انارستان",
"phi": "28.0325489",
" lambda": "52.06646729"
},
{
"State": "بوشهر",
"City": "اهرم",
"phi": "28.88422394",
" lambda": "51.27869415"
},
{
"State": "بوشهر",
"City": "آبپخش",
"phi": "29.35378647",
" lambda": "51.06462097"
},
{
"State": "بوشهر",
"City": "آبدان",
"phi": "28.07392883",
" lambda": "51.77064514"
},
{
"State": "بوشهر",
"City": "برازجان",
"phi": "29.2707119",
" lambda": "51.21670914"
},
{
"State": "بوشهر",
"City": "بردخون",
"phi": "28.06385231",
" lambda": "51.47783661"
},
{
"State": "بوشهر",
"City": "بردستان",
"phi": "27.87148285",
" lambda": "51.95964432"
},
{
"State": "بوشهر",
"City": "بندردير",
"phi": "27.83905983",
" lambda": "51.93501282"
},
{
"State": "بوشهر",
"City": "بندرديلم",
"phi": "30.05228233",
" lambda": "50.16318893"
},
{
"State": "بوشهر",
"City": "بندرريگ",
"phi": "29.4879055",
" lambda": "50.62647629"
},
{
"State": "بوشهر",
"City": "بندركنگان",
"phi": "27.83776283",
" lambda": "52.06179428"
},
{
"State": "بوشهر",
"City": "بندرگناوه",
"phi": "29.57365417",
" lambda": "50.51854324"
},
{
"State": "بوشهر",
"City": "بنك",
"phi": "27.87168884",
" lambda": "52.02739716"
},
{
"State": "بوشهر",
"City": "بوشهر",
"phi": "28.92142677",
" lambda": "50.83766937"
},
{
"State": "بوشهر",
"City": "تنگ ارم",
"phi": "29.15369034",
" lambda": "51.52742004"
},
{
"State": "بوشهر",
"City": "جم",
"phi": "27.82435226",
" lambda": "52.34095001"
},
{
"State": "بوشهر",
"City": "چغادك",
"phi": "28.98757172",
" lambda": "51.02501678"
},
{
"State": "بوشهر",
"City": "خارك",
"phi": "29.23805237",
" lambda": "50.31930542"
},
{
"State": "بوشهر",
"City": "خورموج",
"phi": "28.62718201",
" lambda": "51.38252258"
},
{
"State": "بوشهر",
"City": "دالكي",
"phi": "29.42924118",
" lambda": "51.29114914"
},
{
"State": "بوشهر",
"City": "دلوار",
"phi": "28.74599457",
" lambda": "51.0701828"
},
{
"State": "بوشهر",
"City": "ريز",
"phi": "28.05557632",
" lambda": "52.07707977"
},
{
"State": "بوشهر",
"City": "سعدآباد",
"phi": "29.38419533",
" lambda": "51.116642"
},
{
"State": "بوشهر",
"City": "سيراف",
"phi": "27.66817284",
" lambda": "52.33884811"
},
{
"State": "بوشهر",
"City": "شبانكاره",
"phi": "29.47254372",
" lambda": "50.99406433"
},
{
"State": "بوشهر",
"City": "شنبه",
"phi": "28.39498138",
" lambda": "51.76403046"
},
{
"State": "بوشهر",
"City": "عسلويه",
"phi": "27.47576141",
" lambda": "52.60810852"
},
{
"State": "بوشهر",
"City": "كاكي",
"phi": "28.34020996",
" lambda": "51.52267838"
},
{
"State": "بوشهر",
"City": "كلمه",
"phi": "28.94351768",
" lambda": "51.45933151"
},
{
"State": "بوشهر",
"City": "نخل تقي",
"phi": "27.497015",
" lambda": "52.58398819"
},
{
"State": "بوشهر",
"City": "وحدتيه",
"phi": "29.48295784",
" lambda": "51.23637772"
},
{
"State": "تهران",
"City": "ارجمند",
"phi": "35.81401825",
" lambda": "52.51382446"
},
{
"State": "تهران",
"City": "اسلامشهر",
"phi": "35.50104523",
" lambda": "51.22554779"
},
{
"State": "تهران",
"City": "انديشه",
"phi": "35.68739319",
" lambda": "51.02239227"
},
{
"State": "تهران",
"City": "آبسرد",
"phi": "35.62170792",
" lambda": "52.15012741"
},
{
"State": "تهران",
"City": "آبعلي",
"phi": "35.75962448",
" lambda": "51.96295929"
},
{
"State": "تهران",
"City": "باغستان",
"phi": "35.634552",
" lambda": "51.13315201"
},
{
"State": "تهران",
"City": "باقرشهر",
"phi": "35.52624512",
" lambda": "51.40306091"
},
{
"State": "تهران",
"City": "بومهن",
"phi": "35.72784805",
" lambda": "51.86883163"
},
{
"State": "تهران",
"City": "پاكدشت",
"phi": "35.47431183",
" lambda": "51.67570114"
},
{
"State": "تهران",
"City": "پرديس",
"phi": "35.74234772",
" lambda": "51.82140732"
},
{
"State": "تهران",
"City": "پيشوا",
"phi": "35.30555344",
" lambda": "51.72243881"
},
{
"State": "تهران",
"City": "تجريش",
"phi": "35.81037903",
" lambda": "51.46475983"
},
{
"State": "تهران",
"City": "تهران",
"phi": "35.70290756",
" lambda": "51.34975815"
},
{
"State": "تهران",
"City": "جوادآباد",
"phi": "35.21086121",
" lambda": "51.67318344"
},
{
"State": "تهران",
"City": "چهاردانگه",
"phi": "35.59637451",
" lambda": "51.30456543"
},
{
"State": "تهران",
"City": "حسن آباد ",
"phi": "35.36765671",
" lambda": "51.24298859"
},
{
"State": "تهران",
"City": "دماوند",
"phi": "35.69395447",
" lambda": "52.04721832"
},
{
"State": "تهران",
"City": "رباط كريم",
"phi": "35.48320007",
" lambda": "51.07991409"
},
{
"State": "تهران",
"City": "رودهن",
"phi": "35.73760986",
" lambda": "51.91042328"
},
{
"State": "تهران",
"City": "ري",
"phi": "35.60319138",
" lambda": "51.43870926"
},
{
"State": "تهران",
"City": "شاهدشهر",
"phi": "35.57186127",
" lambda": "51.08738327"
},
{
"State": "تهران",
"City": "شريف آباد",
"phi": "35.42234039",
" lambda": "51.78591919"
},
{
"State": "تهران",
"City": "شهريار",
"phi": "35.63301468",
" lambda": "51.05970383"
},
{
"State": "تهران",
"City": "صالح آباد ",
"phi": "35.50494003",
" lambda": "51.18913651"
},
{
"State": "تهران",
"City": "صباشهر",
"phi": "35.57875824",
" lambda": "51.11426544"
},
{
"State": "تهران",
"City": "صفادشت",
"phi": "35.69135284",
" lambda": "50.84069443"
},
{
"State": "تهران",
"City": "فردوسيه",
"phi": "35.60192871",
" lambda": "51.06320953"
},
{
"State": "تهران",
"City": "فرون آباد",
"phi": "35.50527191",
" lambda": "51.62708282"
},
{
"State": "تهران",
"City": "فشم",
"phi": "35.9017334",
" lambda": "51.51983643"
},
{
"State": "تهران",
"City": "فيروزكوه",
"phi": "35.75455856",
" lambda": "52.77387238"
},
{
"State": "تهران",
"City": "قدس",
"phi": "35.71248245",
" lambda": "51.11289215"
},
{
"State": "تهران",
"City": "قرچك",
"phi": "35.41579437",
" lambda": "51.58667374"
},
{
"State": "تهران",
"City": "كهريزك",
"phi": "35.52381516",
" lambda": "51.35510254"
},
{
"State": "تهران",
"City": "كيلان",
"phi": "35.55614853",
" lambda": "52.16287231"
},
{
"State": "تهران",
"City": "گلستان",
"phi": "35.51601028",
" lambda": "51.16218948"
},
{
"State": "تهران",
"City": "لواسان",
"phi": "35.81940079",
" lambda": "51.63729095"
},
{
"State": "تهران",
"City": "ملارد",
"phi": "35.65470123",
" lambda": "50.97917557"
},
{
"State": "تهران",
"City": "نسيم شهر",
"phi": "35.55868912",
" lambda": "51.16949081"
},
{
"State": "تهران",
"City": "نصيرآباد",
"phi": "35.4901886",
" lambda": "51.14104462"
},
{
"State": "تهران",
"City": "وحيديه",
"phi": "35.60522079",
" lambda": "51.02610397"
},
{
"State": "تهران",
"City": "ورامين",
"phi": "35.32939529",
" lambda": "51.63468552"
},
{
"State": "چهارمحال وبختياري",
"City": "اردل",
"phi": "31.99786568",
" lambda": "50.66145325"
},
{
"State": "چهارمحال وبختياري",
"City": "آلوني",
"phi": "31.55220413",
" lambda": "51.05701447"
},
{
"State": "چهارمحال وبختياري",
"City": "باباحيدر",
"phi": "32.32894516",
" lambda": "50.46887589"
},
{
"State": "چهارمحال وبختياري",
"City": "بروجن",
"phi": "31.96679497",
" lambda": "51.2894249"
},
{
"State": "چهارمحال وبختياري",
"City": "بلداجي",
"phi": "31.93704224",
" lambda": "51.0526123"
},
{
"State": "چهارمحال وبختياري",
"City": "بن",
"phi": "32.54278183",
" lambda": "50.74620819"
},
{
"State": "چهارمحال وبختياري",
"City": "جونقان",
"phi": "32.14295578",
" lambda": "50.68659973"
},
{
"State": "چهارمحال وبختياري",
"City": "چلگرد",
"phi": "32.46727753",
" lambda": "50.13004303"
},
{
"State": "چهارمحال وبختياري",
"City": "سامان",
"phi": "32.45157623",
" lambda": "50.91045761"
},
{
"State": "چهارمحال وبختياري",
"City": "سفيددشت",
"phi": "32.12977219",
" lambda": "51.18287659"
},
{
"State": "چهارمحال وبختياري",
"City": "سودجان",
"phi": "32.52112579",
" lambda": "50.40035629"
},
{
"State": "چهارمحال وبختياري",
"City": "سورشجان",
"phi": "32.31581497",
" lambda": "50.67885208"
},
{
"State": "چهارمحال وبختياري",
"City": "شلمزار",
"phi": "32.04661942",
" lambda": "50.81704712"
},
{
"State": "چهارمحال وبختياري",
"City": "شهركرد",
"phi": "32.31618118",
" lambda": "50.85820389"
},
{
"State": "چهارمحال وبختياري",
"City": "طاقانك",
"phi": "32.22312546",
" lambda": "50.83694077"
},
{
"State": "چهارمحال وبختياري",
"City": "فارسان",
"phi": "32.25729752",
" lambda": "50.56567764"
},
{
"State": "چهارمحال وبختياري",
"City": "فرادنبه",
"phi": "32.00857162",
" lambda": "51.21474838"
},
{
"State": "چهارمحال وبختياري",
"City": "فرخ شهر",
"phi": "32.273983",
" lambda": "50.97294617"
},
{
"State": "چهارمحال وبختياري",
"City": "كيان",
"phi": "32.28331375",
" lambda": "50.88917542"
},
{
"State": "چهارمحال وبختياري",
"City": "گندمان",
"phi": "31.86305046",
" lambda": "51.15338516"
},
{
"State": "چهارمحال وبختياري",
"City": "گهرو",
"phi": "32.00152588",
" lambda": "50.88628769"
},
{
"State": "چهارمحال وبختياري",
"City": "لردگان",
"phi": "31.51081848",
" lambda": "50.83008957"
},
{
"State": "چهارمحال وبختياري",
"City": "مال خليفه",
"phi": "31.28985977",
" lambda": "51.26540756"
},
{
"State": "چهارمحال وبختياري",
"City": "ناغان",
"phi": "31.93432236",
" lambda": "50.73060226"
},
{
"State": "چهارمحال وبختياري",
"City": "نافچ",
"phi": "32.42409515",
" lambda": "50.78843689"
},
{
"State": "چهارمحال وبختياري",
"City": "نقنه",
"phi": "31.93233681",
" lambda": "51.32884216"
},
{
"State": "چهارمحال وبختياري",
"City": "هفشجان",
"phi": "32.22559357",
" lambda": "50.79463196"
},
{
"State": "خراسان جنوبي",
"City": "ارسك",
"phi": "33.70366669",
" lambda": "57.37181854"
},
{
"State": "خراسان جنوبي",
"City": "اسديه",
"phi": "32.91592789",
" lambda": "60.02449036"
},
{
"State": "خراسان جنوبي",
"City": "اسفدن",
"phi": "33.64526749",
" lambda": "59.77878571"
},
{
"State": "خراسان جنوبي",
"City": "اسلاميه",
"phi": "34.04231262",
" lambda": "58.22000885"
},
{
"State": "خراسان جنوبي",
"City": "آرين شهر",
"phi": "33.33110046",
" lambda": "59.23299789"
},
{
"State": "خراسان جنوبي",
"City": "آيسك",
"phi": "33.88665009",
" lambda": "58.38159561"
},
{
"State": "خراسان جنوبي",
"City": "بشرويه",
"phi": "33.85281372",
" lambda": "57.42244339"
},
{
"State": "خراسان جنوبي",
"City": "بيرجند",
"phi": "32.85693359",
" lambda": "59.21954727"
},
{
"State": "خراسان جنوبي",
"City": "حاجي آباد",
"phi": "33.60467529",
" lambda": "59.99753571"
},
{
"State": "خراسان جنوبي",
"City": "خضري دشت بياض",
"phi": "34.02294922",
" lambda": "58.80654144"
},
{
"State": "خراسان جنوبي",
"City": "خوسف",
"phi": "32.77917099",
" lambda": "58.88586426"
},
{
"State": "خراسان جنوبي",
"City": "زهان",
"phi": "33.41973877",
" lambda": "59.8108902"
},
{
"State": "خراسان جنوبي",
"City": "سرايان",
"phi": "33.86037445",
" lambda": "58.52231979"
},
{
"State": "خراسان جنوبي",
"City": "سربيشه",
"phi": "32.5763588",
" lambda": "59.79834747"
},
{
"State": "خراسان جنوبي",
"City": "سه قلعه",
"phi": "33.66646957",
" lambda": "58.39940262"
},
{
"State": "خراسان جنوبي",
"City": "شوسف",
"phi": "31.8033371",
" lambda": "60.00886917"
},
{
"State": "خراسان جنوبي",
"City": "طبس مسينا",
"phi": "32.80108261",
" lambda": "60.22293854"
},
{
"State": "خراسان جنوبي",
"City": "فردوس",
"phi": "34.01807785",
" lambda": "58.17238617"
},
{
"State": "خراسان جنوبي",
"City": "قائن",
"phi": "33.72944641",
" lambda": "59.18090439"
},
{
"State": "خراسان جنوبي",
"City": "قهستان",
"phi": "33.14633179",
" lambda": "59.71578979"
},
{
"State": "خراسان جنوبي",
"City": "گزيك",
"phi": "33.00030136",
" lambda": "60.22256088"
},
{
"State": "خراسان جنوبي",
"City": "محمد شهر",
"phi": "32.87498474",
" lambda": "59.01773453"
},
{
"State": "خراسان جنوبي",
"City": "مود",
"phi": "32.7053299",
" lambda": "59.52415085"
},
{
"State": "خراسان جنوبي",
"City": "نهبندان",
"phi": "31.54078674",
" lambda": "60.03780746"
},
{
"State": "خراسان جنوبي",
"City": "نيمبلوك",
"phi": "33.90110016",
" lambda": "58.92943192"
},
{
"State": "خراسان رضوي",
"City": "احمدآبادصولت",
"phi": "35.11553955",
" lambda": "60.68938065"
},
{
"State": "خراسان رضوي",
"City": "انابد",
"phi": "35.25112152",
" lambda": "57.80986023"
},
{
"State": "خراسان رضوي",
"City": "باجگيران",
"phi": "37.62411499",
" lambda": "58.41529083"
},
{
"State": "خراسان رضوي",
"City": "باخرز",
"phi": "34.98329163",
" lambda": "60.3187561"
},
{
"State": "خراسان رضوي",
"City": "بار",
"phi": "36.48887634",
" lambda": "58.71915436"
},
{
"State": "خراسان رضوي",
"City": "بايگ",
"phi": "35.37513733",
" lambda": "59.03970718"
},
{
"State": "خراسان رضوي",
"City": "بجستان",
"phi": "34.51548767",
" lambda": "58.18186188"
},
{
"State": "خراسان رضوي",
"City": "بردسكن",
"phi": "35.26028061",
" lambda": "57.97204971"
},
{
"State": "خراسان رضوي",
"City": "بيدخت",
"phi": "34.34629059",
" lambda": "58.75733566"
},
{
"State": "خراسان رضوي",
"City": "تايباد",
"phi": "34.73983765",
" lambda": "60.77713776"
},
{
"State": "خراسان رضوي",
"City": "تربت جام",
"phi": "35.24164581",
" lambda": "60.62161636"
},
{
"State": "خراسان رضوي",
"City": "تربت حيدريه",
"phi": "35.27845764",
" lambda": "59.21302032"
},
{
"State": "خراسان رضوي",
"City": "جغتاي",
"phi": "36.63965225",
" lambda": "57.07720566"
},
{
"State": "خراسان رضوي",
"City": "جنگل",
"phi": "34.70163727",
" lambda": "59.22346878"
},
{
"State": "خراسان رضوي",
"City": "چاپشلو",
"phi": "37.34742355",
" lambda": "59.07718277"
},
{
"State": "خراسان رضوي",
"City": "چكنه",
"phi": "36.81797028",
" lambda": "58.50419617"
},
{
"State": "خراسان رضوي",
"City": "چناران",
"phi": "36.64228058",
" lambda": "59.12083817"
},
{
"State": "خراسان رضوي",
"City": "خرو",
"phi": "36.13648987",
" lambda": "59.02706909"
},
{
"State": "خراسان رضوي",
"City": "خليل آباد",
"phi": "35.24498749",
" lambda": "58.28516388"
},
{
"State": "خراسان رضوي",
"City": "خواف",
"phi": "34.56286621",
" lambda": "60.14429474"
},
{
"State": "خراسان رضوي",
"City": "داورزن",
"phi": "36.35125732",
" lambda": "56.87804031"
},
{
"State": "خراسان رضوي",
"City": "درگز",
"phi": "37.44475174",
" lambda": "59.10571289"
},
{
"State": "خراسان رضوي",
"City": "درود",
"phi": "36.13573837",
" lambda": "59.11236954"
},
{
"State": "خراسان رضوي",
"City": "دولت آباد ",
"phi": "35.2820816",
" lambda": "59.52212143"
},
{
"State": "خراسان رضوي",
"City": "رباط سنگ",
"phi": "35.54469681",
" lambda": "59.19417953"
},
{
"State": "خراسان رضوي",
"City": "رشتخوار",
"phi": "34.97506714",
" lambda": "59.62304688"
},
{
"State": "خراسان رضوي",
"City": "رضويه",
"phi": "36.20550156",
" lambda": "59.76985168"
},
{
"State": "خراسان رضوي",
"City": "روداب",
"phi": "36.02081299",
" lambda": "57.31240463"
},
{
"State": "خراسان رضوي",
"City": "ريوش",
"phi": "35.47652435",
" lambda": "58.46169281"
},
{
"State": "خراسان رضوي",
"City": "سبزوار",
"phi": "36.20921326",
" lambda": "57.68231964"
},
{
"State": "خراسان رضوي",
"City": "سرخس",
"phi": "36.54865646",
" lambda": "61.14860153"
},
{
"State": "خراسان رضوي",
"City": "سفيدسنگ",
"phi": "35.66009521",
" lambda": "60.09333038"
},
{
"State": "خراسان رضوي",
"City": "سلامي",
"phi": "34.74436951",
" lambda": "59.97647095"
},
{
"State": "خراسان رضوي",
"City": "سلطان آباد",
"phi": "36.4027977",
" lambda": "58.03989029"
},
{
"State": "خراسان رضوي",
"City": "سنگان",
"phi": "34.39777374",
" lambda": "60.25547791"
},
{
"State": "خراسان رضوي",
"City": "شادمهر",
"phi": "35.17341995",
" lambda": "59.03796387"
},
{
"State": "خراسان رضوي",
"City": "شانديز",
"phi": "36.39521408",
" lambda": "59.29819489"
},
{
"State": "خراسان رضوي",
"City": "ششتمد",
"phi": "35.95957947",
" lambda": "57.77022552"
},
{
"State": "خراسان رضوي",
"City": "شهرآباد",
"phi": "35.14691162",
" lambda": "57.93487167"
},
{
"State": "خراسان رضوي",
"City": "شهرزو",
"phi": "36.74603653",
" lambda": "59.92428207"
},
{
"State": "خراسان رضوي",
"City": "صالح آباد  ",
"phi": "35.6879921",
" lambda": "61.0904541"
},
{
"State": "خراسان رضوي",
"City": "طرقبه",
"phi": "36.3042984",
" lambda": "59.37632751"
},
{
"State": "خراسان رضوي",
"City": "عشق آباد",
"phi": "36.03941727",
" lambda": "58.68320847"
},
{
"State": "خراسان رضوي",
"City": "فرهادگرد",
"phi": "35.75182724",
" lambda": "59.7298851"
},
{
"State": "خراسان رضوي",
"City": "فريمان",
"phi": "35.7040329",
" lambda": "59.84827805"
},
{
"State": "خراسان رضوي",
"City": "فيروزه",
"phi": "36.28560638",
" lambda": "58.58901978"
},
{
"State": "خراسان رضوي",
"City": "فيض آباد",
"phi": "35.01462173",
" lambda": "58.7751236"
},
{
"State": "خراسان رضوي",
"City": "قاسم آباد",
"phi": "34.35560226",
" lambda": "59.86196899"
},
{
"State": "خراسان رضوي",
"City": "قدمگاه",
"phi": "36.10589218",
" lambda": "59.06046677"
},
{
"State": "خراسان رضوي",
"City": "قلندرآباد",
"phi": "35.59896851",
" lambda": "59.95104218"
},
{
"State": "خراسان رضوي",
"City": "قوچان",
"phi": "37.1023674",
" lambda": "58.51087189"
},
{
"State": "خراسان رضوي",
"City": "كاخك",
"phi": "34.14867401",
" lambda": "58.64451218"
},
{
"State": "خراسان رضوي",
"City": "كاريز",
"phi": "34.81363678",
" lambda": "60.82538223"
},
{
"State": "خراسان رضوي",
"City": "كاشمر",
"phi": "35.2427597",
" lambda": "58.45988083"
},
{
"State": "خراسان رضوي",
"City": "كدكن",
"phi": "35.5858345",
" lambda": "58.8789711"
},
{
"State": "خراسان رضوي",
"City": "كلات",
"phi": "36.99456024",
" lambda": "59.74988174"
},
{
"State": "خراسان رضوي",
"City": "كندر",
"phi": "35.21245956",
" lambda": "58.15077972"
},
{
"State": "خراسان رضوي",
"City": "گلمكان",
"phi": "36.48210526",
" lambda": "59.15949249"
},
{
"State": "خراسان رضوي",
"City": "گناباد",
"phi": "34.35174942",
" lambda": "58.68571091"
},
{
"State": "خراسان رضوي",
"City": "لطف آباد",
"phi": "37.51523209",
" lambda": "59.33473206"
},
{
"State": "خراسان رضوي",
"City": "مزدآوند",
"phi": "36.15465164",
" lambda": "60.52762985"
},
{
"State": "خراسان رضوي",
"City": "مشهد",
"phi": "36.31043243",
" lambda": "59.57567215"
},
{
"State": "خراسان رضوي",
"City": "مشهدريزه",
"phi": "34.7951889",
" lambda": "60.50761795"
},
{
"State": "خراسان رضوي",
"City": "ملك آباد",
"phi": "35.99659729",
" lambda": "59.59358597"
},
{
"State": "خراسان رضوي",
"City": "نشتيفان",
"phi": "34.4343605",
" lambda": "60.17642212"
},
{
"State": "خراسان رضوي",
"City": "نصر آباد",
"phi": "35.41807556",
" lambda": "60.31539917"
},
{
"State": "خراسان رضوي",
"City": "نقاب",
"phi": "36.70854568",
" lambda": "57.40815735"
},
{
"State": "خراسان رضوي",
"City": "نوخندان",
"phi": "37.51934814",
" lambda": "58.98891449"
},
{
"State": "خراسان رضوي",
"City": "نيشابور",
"phi": "36.2079277",
" lambda": "58.79402924"
},
{
"State": "خراسان رضوي",
"City": "نيل شهر",
"phi": "35.12285614",
" lambda": "60.77313232"
},
{
"State": "خراسان رضوي",
"City": "همت آباد",
"phi": "36.2977829",
" lambda": "58.4641571"
},
{
"State": "خراسان رضوي",
"City": "يونسي",
"phi": "34.80538177",
" lambda": "58.4372139"
},
{
"State": "خراسان شمالي",
"City": "اسفراين",
"phi": "37.07266617",
" lambda": "57.50966263"
},
{
"State": "خراسان شمالي",
"City": "ايور",
"phi": "36.96881104",
" lambda": "56.26078415"
},
{
"State": "خراسان شمالي",
"City": "آشخانه",
"phi": "37.55817795",
" lambda": "56.92396164"
},
{
"State": "خراسان شمالي",
"City": "بجنورد",
"phi": "37.44678879",
" lambda": "57.32745743"
},
{
"State": "خراسان شمالي",
"City": "پيش قلعه",
"phi": "37.64860153",
" lambda": "57.00147629"
},
{
"State": "خراسان شمالي",
"City": "تيتكانلو",
"phi": "37.28055573",
" lambda": "58.28951263"
},
{
"State": "خراسان شمالي",
"City": "جاجرم",
"phi": "36.9556427",
" lambda": "56.35777664"
},
{
"State": "خراسان شمالي",
"City": "حصارگرمخان",
"phi": "37.51585388",
" lambda": "57.48488617"
},
{
"State": "خراسان شمالي",
"City": "درق",
"phi": "36.97206879",
" lambda": "56.21450043"
},
{
"State": "خراسان شمالي",
"City": "راز",
"phi": "37.93445587",
" lambda": "57.10754776"
},
{
"State": "خراسان شمالي",
"City": "سنخواست",
"phi": "37.09990311",
" lambda": "56.85155869"
},
{
"State": "خراسان شمالي",
"City": "شوقان",
"phi": "37.34163666",
" lambda": "56.88708115"
},
{
"State": "خراسان شمالي",
"City": "شيروان",
"phi": "37.40151596",
" lambda": "57.92416763"
},
{
"State": "خراسان شمالي",
"City": "صفي آباد",
"phi": "36.69550323",
" lambda": "57.92702484"
},
{
"State": "خراسان شمالي",
"City": "فاروج",
"phi": "37.22369385",
" lambda": "58.2189064"
},
{
"State": "خراسان شمالي",
"City": "قاضي",
"phi": "37.49500656",
" lambda": "56.74865723"
},
{
"State": "خراسان شمالي",
"City": "گرمه",
"phi": "36.97851944",
" lambda": "56.30154037"
},
{
"State": "خراسان شمالي",
"City": "لوجلي",
"phi": "37.60704041",
" lambda": "57.8576355"
},
{
"State": "خوزستان",
"City": "اروندكنار",
"phi": "29.97808266",
" lambda": "48.51682663"
},
{
"State": "خوزستان",
"City": "الوان",
"phi": "31.87410164",
" lambda": "48.34111404"
},
{
"State": "خوزستان",
"City": "اميديه",
"phi": "30.7556076",
" lambda": "49.71224976"
},
{
"State": "خوزستان",
"City": "انديمشك",
"phi": "32.42464447",
" lambda": "48.37310028"
},
{
"State": "خوزستان",
"City": "اهواز",
"phi": "31.24201393",
" lambda": "48.67127228"
},
{
"State": "خوزستان",
"City": "ايذه",
"phi": "31.83068466",
" lambda": "49.86493683"
},
{
"State": "خوزستان",
"City": "آبادان",
"phi": "30.35600853",
" lambda": "48.28005219"
},
{
"State": "خوزستان",
"City": "آغاجاري",
"phi": "30.69972038",
" lambda": "49.82976913"
},
{
"State": "خوزستان",
"City": "باغ ملك",
"phi": "31.51330566",
" lambda": "49.8904953"
},
{
"State": "خوزستان",
"City": "بستان",
"phi": "31.72163963",
" lambda": "47.98114777"
},
{
"State": "خوزستان",
"City": "بندرامام خميني",
"phi": "30.43869972",
" lambda": "49.07567215"
},
{
"State": "خوزستان",
"City": "بندرماهشهر",
"phi": "30.46946907",
" lambda": "49.18000793"
},
{
"State": "خوزستان",
"City": "بهبهان",
"phi": "30.59626389",
" lambda": "50.24160767"
},
{
"State": "خوزستان",
"City": "تركالكي",
"phi": "32.24267578",
" lambda": "48.84632111"
},
{
"State": "خوزستان",
"City": "جايزان",
"phi": "30.87495041",
" lambda": "49.85443497"
},
{
"State": "خوزستان",
"City": "جنت مكان",
"phi": "32.1843071",
" lambda": "48.81614685"
},
{
"State": "خوزستان",
"City": "چغاميش",
"phi": "32.20948029",
" lambda": "48.54555511"
},
{
"State": "خوزستان",
"City": "چمران",
"phi": "30.71356392",
" lambda": "49.17686844"
},
{
"State": "خوزستان",
"City": "چوئبده",
"phi": "30.20004654",
" lambda": "48.55318832"
},
{
"State": "خوزستان",
"City": "حر",
"phi": "32.14421844",
" lambda": "48.39052582"
},
{
"State": "خوزستان",
"City": "حسينيه",
"phi": "32.66335297",
" lambda": "48.24562073"
},
{
"State": "خوزستان",
"City": "حمزه",
"phi": "32.39622498",
" lambda": "48.5785408"
},
{
"State": "خوزستان",
"City": "حميديه",
"phi": "31.48162079",
" lambda": "48.43239975"
},
{
"State": "خوزستان",
"City": "خرمشهر",
"phi": "30.4448185",
" lambda": "48.17879105"
},
{
"State": "خوزستان",
"City": "دارخوين",
"phi": "30.74493217",
" lambda": "48.42924881"
},
{
"State": "خوزستان",
"City": "دزآب",
"phi": "32.28790665",
" lambda": "48.42823792"
},
{
"State": "خوزستان",
"City": "دزفول",
"phi": "32.37889481",
" lambda": "48.41930008"
},
{
"State": "خوزستان",
"City": "دهدز",
"phi": "31.70995522",
" lambda": "50.28852844"
},
{
"State": "خوزستان",
"City": "رامشير",
"phi": "30.89275551",
" lambda": "49.40882874"
},
{
"State": "خوزستان",
"City": "رامهرمز",
"phi": "31.25921631",
" lambda": "49.60531235"
},
{
"State": "خوزستان",
"City": "رفيع",
"phi": "31.597435",
" lambda": "47.89417267"
},
{
"State": "خوزستان",
"City": "زهره",
"phi": "30.46815491",
" lambda": "49.6830101"
},
{
"State": "خوزستان",
"City": "سالند",
"phi": "32.49406815",
" lambda": "48.83433533"
},
{
"State": "خوزستان",
"City": "سردشت ",
"phi": "30.32780647",
" lambda": "50.21788025"
},
{
"State": "خوزستان",
"City": "سماله",
"phi": "32.19401169",
" lambda": "48.85775375"
},
{
"State": "خوزستان",
"City": "سوسنگرد",
"phi": "31.55861473",
" lambda": "48.18958664"
},
{
"State": "خوزستان",
"City": "شادگان",
"phi": "30.64126205",
" lambda": "48.66353607"
},
{
"State": "خوزستان",
"City": "شاوور",
"phi": "32.0586853",
" lambda": "48.3008728"
},
{
"State": "خوزستان",
"City": "شرافت",
"phi": "32.08808136",
" lambda": "48.76771927"
},
{
"State": "خوزستان",
"City": "شوش",
"phi": "32.20674515",
" lambda": "48.25742722"
},
{
"State": "خوزستان",
"City": "شوشتر",
"phi": "32.05464172",
" lambda": "48.8347168"
},
{
"State": "خوزستان",
"City": "شيبان",
"phi": "31.38457489",
" lambda": "48.78711319"
},
{
"State": "خوزستان",
"City": "صالح شهر",
"phi": "32.21367264",
" lambda": "48.67218399"
},
{
"State": "خوزستان",
"City": "صالح مشطط",
"phi": "32.31357956",
" lambda": "48.14806747"
},
{
"State": "خوزستان",
"City": "صفي آباد ",
"phi": "32.2478447",
" lambda": "48.42150879"
},
{
"State": "خوزستان",
"City": "صيدون",
"phi": "31.36574364",
" lambda": "50.0813942"
},
{
"State": "خوزستان",
"City": "قلعه تل",
"phi": "31.63149834",
" lambda": "49.89017868"
},
{
"State": "خوزستان",
"City": "قلعه خواجه",
"phi": "32.20529938",
" lambda": "49.44870377"
},
{
"State": "خوزستان",
"City": "گتوند",
"phi": "32.24721527",
" lambda": "48.81782532"
},
{
"State": "خوزستان",
"City": "گوريه",
"phi": "31.85664177",
" lambda": "48.75579071"
},
{
"State": "خوزستان",
"City": "لالي",
"phi": "32.32981873",
" lambda": "49.09298325"
},
{
"State": "خوزستان",
"City": "مسجدسليمان",
"phi": "31.96466255",
" lambda": "49.28633881"
},
{
"State": "خوزستان",
"City": "مشراگه",
"phi": "31.01070213",
" lambda": "49.43793869"
},
{
"State": "خوزستان",
"City": "مقاومت",
"phi": "30.40689087",
" lambda": "48.19532776"
},
{
"State": "خوزستان",
"City": "ملاثاني",
"phi": "31.58534813",
" lambda": "48.88701248"
},
{
"State": "خوزستان",
"City": "ميانرود",
"phi": "32.22786713",
" lambda": "48.42446136"
},
{
"State": "خوزستان",
"City": "ميداود",
"phi": "31.37246704",
" lambda": "49.81366348"
},
{
"State": "خوزستان",
"City": "مينوشهر",
"phi": "30.36065483",
" lambda": "48.21039581"
},
{
"State": "خوزستان",
"City": "ويس",
"phi": "31.48414421",
" lambda": "48.8745079"
},
{
"State": "خوزستان",
"City": "هفتگل",
"phi": "31.44567871",
" lambda": "49.53313828"
},
{
"State": "خوزستان",
"City": "هنديجان",
"phi": "30.22368622",
" lambda": "49.71139908"
},
{
"State": "خوزستان",
"City": "هويزه",
"phi": "31.46068192",
" lambda": "48.07748795"
},
{
"State": "زنجان",
"City": "ابهر",
"phi": "36.13613129",
" lambda": "49.22454453"
},
{
"State": "زنجان",
"City": "ارمغانخانه",
"phi": "36.97814941",
" lambda": "48.37194061"
},
{
"State": "زنجان",
"City": "آب بر",
"phi": "36.92785263",
" lambda": "48.95616531"
},
{
"State": "زنجان",
"City": "چورزق",
"phi": "36.99287796",
" lambda": "48.77852631"
},
{
"State": "زنجان",
"City": "حلب",
"phi": "36.29621124",
" lambda": "48.06386185"
},
{
"State": "زنجان",
"City": "خرمدره",
"phi": "36.2114563",
" lambda": "49.19538879"
},
{
"State": "زنجان",
"City": "دندي",
"phi": "36.55109406",
" lambda": "47.62024307"
},
{
"State": "زنجان",
"City": "زرين آباد",
"phi": "36.42923355",
" lambda": "48.27695084"
},
{
"State": "زنجان",
"City": "زرين رود",
"phi": "35.75621796",
" lambda": "48.48109055"
},
{
"State": "زنجان",
"City": "زنجان",
"phi": "36.67955399",
" lambda": "48.49299622"
},
{
"State": "زنجان",
"City": "سجاس",
"phi": "36.24058914",
" lambda": "48.55308533"
},
{
"State": "زنجان",
"City": "سلطانيه",
"phi": "36.4336319",
" lambda": "48.79550552"
},
{
"State": "زنجان",
"City": "سهرورد",
"phi": "36.07280731",
" lambda": "48.43910217"
},
{
"State": "زنجان",
"City": "صائين قلعه",
"phi": "36.30476761",
" lambda": "49.07235336"
},
{
"State": "زنجان",
"City": "قيدار",
"phi": "36.10856628",
" lambda": "48.58998871"
},
{
"State": "زنجان",
"City": "گرماب",
"phi": "35.84553909",
" lambda": "48.20112228"
},
{
"State": "زنجان",
"City": "ماه نشان",
"phi": "36.74358368",
" lambda": "47.67064667"
},
{
"State": "زنجان",
"City": "هيدج",
"phi": "36.25403976",
" lambda": "49.12958527"
},
{
"State": "سمنان",
"City": "اميريه",
"phi": "36.02804947",
" lambda": "54.14220428"
},
{
"State": "سمنان",
"City": "ايوانكي",
"phi": "35.34497452",
" lambda": "52.06897736"
},
{
"State": "سمنان",
"City": "آرادان",
"phi": "35.25164795",
" lambda": "52.49753952"
},
{
"State": "سمنان",
"City": "بسطام",
"phi": "36.48446274",
" lambda": "55.00090027"
},
{
"State": "سمنان",
"City": "بيارجمند",
"phi": "36.07866669",
" lambda": "55.80743027"
},
{
"State": "سمنان",
"City": "دامغان",
"phi": "36.16519928",
" lambda": "54.344841"
},
{
"State": "سمنان",
"City": "درجزين",
"phi": "35.64560699",
" lambda": "53.33364105"
},
{
"State": "سمنان",
"City": "ديباج",
"phi": "36.43052292",
" lambda": "54.22891235"
},
{
"State": "سمنان",
"City": "سرخه",
"phi": "35.46372604",
" lambda": "53.21035767"
},
{
"State": "سمنان",
"City": "سمنان",
"phi": "35.57711411",
" lambda": "53.38192749"
},
{
"State": "سمنان",
"City": "شاهرود",
"phi": "36.41208649",
" lambda": "54.9724617"
},
{
"State": "سمنان",
"City": "شهميرزاد",
"phi": "35.77023315",
" lambda": "53.33358383"
},
{
"State": "سمنان",
"City": "كلاته خيج",
"phi": "36.67056274",
" lambda": "55.30048752"
},
{
"State": "سمنان",
"City": "گرمسار",
"phi": "35.21782303",
" lambda": "52.33362579"
},
{
"State": "سمنان",
"City": "مجن",
"phi": "36.48022079",
" lambda": "54.64797974"
},
{
"State": "سمنان",
"City": "مهدي شهر",
"phi": "35.69964981",
" lambda": "53.34587097"
},
{
"State": "سمنان",
"City": "ميامي",
"phi": "36.40932465",
" lambda": "55.65165329"
},
{
"State": "سيستان وبلوچستان",
"City": "اديمي",
"phi": "31.11745262",
" lambda": "61.40764236"
},
{
"State": "سيستان وبلوچستان",
"City": "اسپكه",
"phi": "26.83735847",
" lambda": "60.17232513"
},
{
"State": "سيستان وبلوچستان",
"City": "ايرانشهر",
"phi": "27.20416451",
" lambda": "60.67512894"
},
{
"State": "سيستان وبلوچستان",
"City": "بزمان",
"phi": "27.85034561",
" lambda": "60.1754837"
},
{
"State": "سيستان وبلوچستان",
"City": "بمپور",
"phi": "27.19374084",
" lambda": "60.45621872"
},
{
"State": "سيستان وبلوچستان",
"City": "بنت",
"phi": "26.28682327",
" lambda": "59.52267075"
},
{
"State": "سيستان وبلوچستان",
"City": "بنجار",
"phi": "31.04289436",
" lambda": "61.56745148"
},
{
"State": "سيستان وبلوچستان",
"City": "پيشين",
"phi": "26.07985497",
" lambda": "61.74840164"
},
{
"State": "سيستان وبلوچستان",
"City": "جالق",
"phi": "27.58278656",
" lambda": "62.70072556"
},
{
"State": "سيستان وبلوچستان",
"City": "چاه بهار",
"phi": "25.29451942",
" lambda": "60.64770126"
},
{
"State": "سيستان وبلوچستان",
"City": "خاش",
"phi": "28.20943642",
" lambda": "61.20286179"
},
{
"State": "سيستان وبلوچستان",
"City": "دوست محمد",
"phi": "31.14273262",
" lambda": "61.79280853"
},
{
"State": "سيستان وبلوچستان",
"City": "راسك",
"phi": "26.23325157",
" lambda": "61.40544128"
},
{
"State": "سيستان وبلوچستان",
"City": "زابل",
"phi": "31.00886726",
" lambda": "61.49380875"
},
{
"State": "سيستان وبلوچستان",
"City": "زابلي",
"phi": "27.11458778",
" lambda": "61.67259979"
},
{
"State": "سيستان وبلوچستان",
"City": "زاهدان",
"phi": "29.48213577",
" lambda": "60.85205078"
},
{
"State": "سيستان وبلوچستان",
"City": "زرآباد",
"phi": "25.5872364",
" lambda": "59.39628983"
},
{
"State": "سيستان وبلوچستان",
"City": "زهك",
"phi": "30.89316177",
" lambda": "61.68292618"
},
{
"State": "سيستان وبلوچستان",
"City": "سراوان",
"phi": "27.36134338",
" lambda": "62.33307266"
},
{
"State": "سيستان وبلوچستان",
"City": "سرباز",
"phi": "26.63323593",
" lambda": "61.25806046"
},
{
"State": "سيستان وبلوچستان",
"City": "سوران",
"phi": "27.28602982",
" lambda": "61.99488068"
},
{
"State": "سيستان وبلوچستان",
"City": "سيركان",
"phi": "26.82987213",
" lambda": "62.63848114"
},
{
"State": "سيستان وبلوچستان",
"City": "علي اكبر",
"phi": "30.93907928",
" lambda": "61.32796478"
},
{
"State": "سيستان وبلوچستان",
"City": "فنوج",
"phi": "26.57572746",
" lambda": "59.6449852"
},
{
"State": "سيستان وبلوچستان",
"City": "قصرقند",
"phi": "26.2130394",
" lambda": "60.74167633"
},
{
"State": "سيستان وبلوچستان",
"City": "كنارك",
"phi": "25.35951996",
" lambda": "60.39698029"
},
{
"State": "سيستان وبلوچستان",
"City": "گشت",
"phi": "27.78860664",
" lambda": "61.95108795"
},
{
"State": "سيستان وبلوچستان",
"City": "گلمورتي",
"phi": "27.48122978",
" lambda": "59.44732285"
},
{
"State": "سيستان وبلوچستان",
"City": "محمدان",
"phi": "27.19989777",
" lambda": "60.56081772"
},
{
"State": "سيستان وبلوچستان",
"City": "محمد آباد",
"phi": "30.87292671",
" lambda": "61.46186447"
},
{
"State": "سيستان وبلوچستان",
"City": "محمدي",
"phi": "27.32683372",
" lambda": "62.39016724"
},
{
"State": "سيستان وبلوچستان",
"City": "ميرجاوه",
"phi": "29.01564407",
" lambda": "61.44954681"
},
{
"State": "سيستان وبلوچستان",
"City": "نصرت آباد",
"phi": "29.85798264",
" lambda": "59.97365952"
},
{
"State": "سيستان وبلوچستان",
"City": "نگور",
"phi": "25.38880539",
" lambda": "61.13994217"
},
{
"State": "سيستان وبلوچستان",
"City": "نوك آباد",
"phi": "28.53910828",
" lambda": "60.75888062"
},
{
"State": "سيستان وبلوچستان",
"City": "نيك شهر",
"phi": "26.23455238",
" lambda": "60.22686005"
},
{
"State": "سيستان وبلوچستان",
"City": "هيدوج",
"phi": "27.00206184",
" lambda": "62.11936951"
},
{
"State": "فارس",
"City": "اردكان",
"phi": "30.2320652",
" lambda": "51.99205017"
},
{
"State": "فارس",
"City": "ارسنجان",
"phi": "29.90981102",
" lambda": "53.30069733"
},
{
"State": "فارس",
"City": "استهبان",
"phi": "29.12606621",
" lambda": "54.04462814"
},
{
"State": "فارس",
"City": "اسير",
"phi": "27.72283173",
" lambda": "52.66568756"
},
{
"State": "فارس",
"City": "اشكنان",
"phi": "27.22553635",
" lambda": "53.60817337"
},
{
"State": "فارس",
"City": "افزر",
"phi": "28.3462944",
" lambda": "52.96562576"
},
{
"State": "فارس",
"City": "اقليد",
"phi": "30.90192032",
" lambda": "52.70526123"
},
{
"State": "فارس",
"City": "امام شهر",
"phi": "28.44523621",
" lambda": "53.15060425"
},
{
"State": "فارس",
"City": "اوز",
"phi": "27.75788116",
" lambda": "54.01237869"
},
{
"State": "فارس",
"City": "اهل",
"phi": "27.21099472",
" lambda": "53.65979385"
},
{
"State": "فارس",
"City": "ايج",
"phi": "29.02017212",
" lambda": "54.24538422"
},
{
"State": "فارس",
"City": "ايزدخواست",
"phi": "31.51700974",
" lambda": "52.12493515"
},
{
"State": "فارس",
"City": "آباده",
"phi": "31.14298248",
" lambda": "52.65011597"
},
{
"State": "فارس",
"City": "آباده طشك",
"phi": "29.80986214",
" lambda": "53.73068619"
},
{
"State": "فارس",
"City": "باب انار",
"phi": "28.96844482",
" lambda": "53.20914459"
},
{
"State": "فارس",
"City": "بالاده",
"phi": "29.28499222",
" lambda": "51.9389267"
},
{
"State": "فارس",
"City": "بنارويه",
"phi": "28.08661079",
" lambda": "54.04563141"
},
{
"State": "فارس",
"City": "بوانات",
"phi": "30.46093559",
" lambda": "53.63896561"
},
{
"State": "فارس",
"City": "بهمن",
"phi": "31.19485855",
" lambda": "52.4853096"
},
{
"State": "فارس",
"City": "بيرم",
"phi": "27.43091202",
" lambda": "53.51512146"
},
{
"State": "فارس",
"City": "بيضا",
"phi": "29.97089386",
" lambda": "52.39775848"
},
{
"State": "فارس",
"City": "جنت شهر",
"phi": "28.65347481",
" lambda": "54.68517685"
},
{
"State": "فارس",
"City": "جويم",
"phi": "28.26154518",
" lambda": "53.97995377"
},
{
"State": "فارس",
"City": "جهرم",
"phi": "28.49491882",
" lambda": "53.5668869"
},
{
"State": "فارس",
"City": "حاجي آباد ",
"phi": "28.35749626",
" lambda": "54.42031479"
},
{
"State": "فارس",
"City": "حسامي",
"phi": "29.96754265",
" lambda": "53.87240601"
},
{
"State": "فارس",
"City": "حسن آباد  ",
"phi": "30.51979637",
" lambda": "52.45603943"
},
{
"State": "فارس",
"City": "خانه زنيان",
"phi": "29.67118645",
" lambda": "52.14970398"
},
{
"State": "فارس",
"City": "خاوران",
"phi": "28.93893814",
" lambda": "53.31309509"
},
{
"State": "فارس",
"City": "خرامه",
"phi": "29.49304962",
" lambda": "53.31003189"
},
{
"State": "فارس",
"City": "خشت",
"phi": "29.55426025",
" lambda": "51.33544159"
},
{
"State": "فارس",
"City": "خنج",
"phi": "27.89233208",
" lambda": "53.42961502"
},
{
"State": "فارس",
"City": "خور ",
"phi": "27.64462852",
" lambda": "54.34395218"
},
{
"State": "فارس",
"City": "خومه زار",
"phi": "30.00632477",
" lambda": "51.57812119"
},
{
"State": "فارس",
"City": "داراب",
"phi": "28.75426102",
" lambda": "54.54712296"
},
{
"State": "فارس",
"City": "داريان",
"phi": "29.56033134",
" lambda": "52.92008972"
},
{
"State": "فارس",
"City": "دبيران",
"phi": "28.39616203",
" lambda": "54.18682861"
},
{
"State": "فارس",
"City": "دژكرد",
"phi": "30.71361351",
" lambda": "51.95794296"
},
{
"State": "فارس",
"City": "دوبرجي",
"phi": "28.30734062",
" lambda": "55.19250488"
},
{
"State": "فارس",
"City": "دوزه",
"phi": "28.70108604",
" lambda": "52.95849228"
},
{
"State": "فارس",
"City": "دهرم",
"phi": "28.49329376",
" lambda": "52.30422211"
},
{
"State": "فارس",
"City": "رامجرد",
"phi": "30.0748806",
" lambda": "52.59263611"
},
{
"State": "فارس",
"City": "رونيز",
"phi": "29.19205666",
" lambda": "53.76940155"
},
{
"State": "فارس",
"City": "زاهدشهر",
"phi": "28.74662971",
" lambda": "53.80464935"
},
{
"State": "فارس",
"City": "زرقان",
"phi": "29.77383232",
" lambda": "52.72177887"
},
{
"State": "فارس",
"City": "سده",
"phi": "30.71057892",
" lambda": "52.17611694"
},
{
"State": "فارس",
"City": "سروستان",
"phi": "29.26302719",
" lambda": "53.22387314"
},
{
"State": "فارس",
"City": "سعادت شهر",
"phi": "30.07427406",
" lambda": "53.13613129"
},
{
"State": "فارس",
"City": "سورمق",
"phi": "31.03448868",
" lambda": "52.83955765"
},
{
"State": "فارس",
"City": "سيدان",
"phi": "30.0044632",
" lambda": "53.00567627"
},
{
"State": "فارس",
"City": "ششده",
"phi": "28.94964218",
" lambda": "53.99575806"
},
{
"State": "فارس",
"City": "شهر جديد صدرا",
"phi": "29.80101395",
" lambda": "52.50849533"
},
{
"State": "فارس",
"City": "شهرپير",
"phi": "28.3116951",
" lambda": "54.33503342"
},
{
"State": "فارس",
"City": "شيراز",
"phi": "29.55689049",
" lambda": "52.5291214"
},
{
"State": "فارس",
"City": "صغاد",
"phi": "31.19107056",
" lambda": "52.51543427"
},
{
"State": "فارس",
"City": "صفاشهر",
"phi": "30.61366653",
" lambda": "53.19872284"
},
{
"State": "فارس",
"City": "علامرودشت",
"phi": "27.62446213",
" lambda": "53.00065994"
},
{
"State": "فارس",
"City": "عمادده",
"phi": "27.44464493",
" lambda": "53.86183548"
},
{
"State": "فارس",
"City": "فدامي",
"phi": "28.21680832",
" lambda": "55.13514328"
},
{
"State": "فارس",
"City": "فراشبند",
"phi": "28.85889053",
" lambda": "52.09375"
},
{
"State": "فارس",
"City": "فسا",
"phi": "28.91972542",
" lambda": "53.6376915"
},
{
"State": "فارس",
"City": "فيروزآباد",
"phi": "28.84885597",
" lambda": "52.56980133"
},
{
"State": "فارس",
"City": "قادرآباد",
"phi": "30.28066635",
" lambda": "53.25508881"
},
{
"State": "فارس",
"City": "قائميه",
"phi": "29.84431648",
" lambda": "51.59110641"
},
{
"State": "فارس",
"City": "قطب آباد",
"phi": "28.64067459",
" lambda": "53.63947296"
},
{
"State": "فارس",
"City": "قطرويه",
"phi": "29.14603615",
" lambda": "54.70355225"
},
{
"State": "فارس",
"City": "قير",
"phi": "28.474617",
" lambda": "53.04390335"
},
{
"State": "فارس",
"City": "كارزين",
"phi": "28.4087162",
" lambda": "53.10852432"
},
{
"State": "فارس",
"City": "كازرون",
"phi": "29.60374641",
" lambda": "51.65179825"
},
{
"State": "فارس",
"City": "كامفيروز",
"phi": "30.32198334",
" lambda": "52.19429398"
},
{
"State": "فارس",
"City": "كره اي",
"phi": "30.02972603",
" lambda": "53.71575546"
},
{
"State": "فارس",
"City": "كنارتخته",
"phi": "29.53391266",
" lambda": "51.39491653"
},
{
"State": "فارس",
"City": "كوار",
"phi": "29.19608498",
" lambda": "52.68671799"
},
{
"State": "فارس",
"City": "كوهنجان",
"phi": "29.2311306",
" lambda": "52.95619202"
},
{
"State": "فارس",
"City": "گراش",
"phi": "27.66714287",
" lambda": "54.14503479"
},
{
"State": "فارس",
"City": "گله دار",
"phi": "27.64880753",
" lambda": "52.66020584"
},
{
"State": "فارس",
"City": "لار",
"phi": "27.6426487",
" lambda": "54.32035828"
},
{
"State": "فارس",
"City": "لامرد",
"phi": "27.3299675",
" lambda": "53.18791962"
},
{
"State": "فارس",
"City": "لپوئي",
"phi": "29.79907227",
" lambda": "52.65207291"
},
{
"State": "فارس",
"City": "لطيفي",
"phi": "27.68995857",
" lambda": "54.38670349"
},
{
"State": "فارس",
"City": "مبارك آباد",
"phi": "28.36018181",
" lambda": "53.32870102"
},
{
"State": "فارس",
"City": "مرودشت",
"phi": "29.85951042",
" lambda": "52.81027222"
},
{
"State": "فارس",
"City": "مشكان",
"phi": "29.47281647",
" lambda": "54.34591293"
},
{
"State": "فارس",
"City": "مصيري",
"phi": "30.24431038",
" lambda": "51.52890396"
},
{
"State": "فارس",
"City": "مهر",
"phi": "27.55045891",
" lambda": "52.8838501"
},
{
"State": "فارس",
"City": "ميمند",
"phi": "28.86828804",
" lambda": "52.75091553"
},
{
"State": "فارس",
"City": "نوبندگان",
"phi": "28.85382271",
" lambda": "53.8259201"
},
{
"State": "فارس",
"City": "نوجين",
"phi": "29.12537384",
" lambda": "52.01348877"
},
{
"State": "فارس",
"City": "نودان",
"phi": "29.80166054",
" lambda": "51.69422913"
},
{
"State": "فارس",
"City": "نورآباد",
"phi": "30.11481667",
" lambda": "51.52225113"
},
{
"State": "فارس",
"City": "ني ريز",
"phi": "29.19792175",
" lambda": "54.32265472"
},
{
"State": "فارس",
"City": "وراوي",
"phi": "27.46503258",
" lambda": "53.05218506"
},
{
"State": "فارس",
"City": "هماشهر",
"phi": "30.1154232",
" lambda": "52.087677"
},
{
"State": "قزوين",
"City": "ارداق",
"phi": "36.05335617",
" lambda": "49.82441711"
},
{
"State": "قزوين",
"City": "اسفرورين",
"phi": "35.93508148",
" lambda": "49.7502861"
},
{
"State": "قزوين",
"City": "اقباليه",
"phi": "36.23208618",
" lambda": "49.92666245"
},
{
"State": "قزوين",
"City": "الوند",
"phi": "36.17034149",
" lambda": "50.0741539"
},
{
"State": "قزوين",
"City": "آبگرم",
"phi": "35.75740051",
" lambda": "49.2872963"
},
{
"State": "قزوين",
"City": "آبيك",
"phi": "36.03989029",
" lambda": "50.52969742"
},
{
"State": "قزوين",
"City": "آوج",
"phi": "35.57978058",
" lambda": "49.2218399"
},
{
"State": "قزوين",
"City": "بوئين زهرا",
"phi": "35.75715256",
" lambda": "50.06196976"
},
{
"State": "قزوين",
"City": "بيدستان",
"phi": "36.23126602",
" lambda": "50.12140274"
},
{
"State": "قزوين",
"City": "تاكستان",
"phi": "36.07141876",
" lambda": "49.69615936"
},
{
"State": "قزوين",
"City": "خاكعلي",
"phi": "36.12889099",
" lambda": "50.17577744"
},
{
"State": "قزوين",
"City": "خرمدشت",
"phi": "35.9298439",
" lambda": "49.51174545"
},
{
"State": "قزوين",
"City": "دانسفهان",
"phi": "35.81162643",
" lambda": "49.74360275"
},
{
"State": "قزوين",
"City": "رازميان",
"phi": "36.53649139",
" lambda": "50.21233749"
},
{
"State": "قزوين",
"City": "سگزآباد",
"phi": "35.76412964",
" lambda": "49.9394722"
},
{
"State": "قزوين",
"City": "سيردان",
"phi": "36.65159225",
" lambda": "49.18821335"
},
{
"State": "قزوين",
"City": "شال",
"phi": "35.89759827",
" lambda": "49.76836777"
},
{
"State": "قزوين",
"City": "شريفيه",
"phi": "36.2034111",
" lambda": "50.1513443"
},
{
"State": "قزوين",
"City": "ضياءآباد",
"phi": "35.99550629",
" lambda": "49.44933701"
},
{
"State": "قزوين",
"City": "قزوين",
"phi": "36.28174591",
" lambda": "50.00196838"
},
{
"State": "قزوين",
"City": "كوهين",
"phi": "36.37286758",
" lambda": "49.65810776"
},
{
"State": "قزوين",
"City": "محمديه",
"phi": "36.2240181",
" lambda": "50.18258667"
},
{
"State": "قزوين",
"City": "محمودآبادنمونه",
"phi": "36.29042053",
" lambda": "49.9026413"
},
{
"State": "قزوين",
"City": "معلم كلايه",
"phi": "36.44727707",
" lambda": "50.47819519"
},
{
"State": "قزوين",
"City": "نرجه",
"phi": "35.99202347",
" lambda": "49.62033081"
},
{
"State": "قم",
"City": "جعفريه",
"phi": "34.77463913",
" lambda": "50.51660538"
},
{
"State": "قم",
"City": "دستجرد",
"phi": "34.55284882",
" lambda": "50.24821854"
},
{
"State": "قم",
"City": "سلفچگان",
"phi": "34.47826385",
" lambda": "50.45762634"
},
{
"State": "قم",
"City": "قم",
"phi": "34.59394836",
" lambda": "50.87429047"
},
{
"State": "قم",
"City": "قنوات",
"phi": "34.61101151",
" lambda": "51.02547073"
},
{
"State": "قم",
"City": "كهك",
"phi": "34.39292526",
" lambda": "50.86410904"
},
{
"State": "كردستان",
"City": "آرمرده",
"phi": "35.92939377",
" lambda": "45.79673004"
},
{
"State": "كردستان",
"City": "بابارشاني",
"phi": "35.67422485",
" lambda": "47.79747391"
},
{
"State": "كردستان",
"City": "بانه",
"phi": "35.99573135",
" lambda": "45.88861465"
},
{
"State": "كردستان",
"City": "بلبان آباد",
"phi": "35.13714218",
" lambda": "47.32099152"
},
{
"State": "كردستان",
"City": "بوئين سفلي",
"phi": "35.9389801",
" lambda": "45.93625259"
},
{
"State": "كردستان",
"City": "بيجار",
"phi": "35.88286209",
" lambda": "47.61825943"
},
{
"State": "كردستان",
"City": "چناره",
"phi": "35.63011932",
" lambda": "46.3091011"
},
{
"State": "كردستان",
"City": "دزج",
"phi": "35.06471634",
" lambda": "47.96392441"
},
{
"State": "كردستان",
"City": "دلبران",
"phi": "35.23840332",
" lambda": "47.98857117"
},
{
"State": "كردستان",
"City": "دهگلان",
"phi": "35.27833557",
" lambda": "47.41890335"
},
{
"State": "كردستان",
"City": "ديواندره",
"phi": "35.91249084",
" lambda": "47.02490616"
},
{
"State": "كردستان",
"City": "زرينه",
"phi": "36.06072617",
" lambda": "46.91876602"
},
{
"State": "كردستان",
"City": "سروآباد",
"phi": "35.3117981",
" lambda": "46.36698914"
},
{
"State": "كردستان",
"City": "سريش آباد",
"phi": "35.24881363",
" lambda": "47.77849197"
},
{
"State": "كردستان",
"City": "سقز",
"phi": "36.24411774",
" lambda": "46.27292252"
},
{
"State": "كردستان",
"City": "سنندج",
"phi": "35.24031448",
" lambda": "47.00640869"
},
{
"State": "كردستان",
"City": "شويشه",
"phi": "35.3529129",
" lambda": "46.67845535"
},
{
"State": "كردستان",
"City": "صاحب",
"phi": "36.20309448",
" lambda": "46.46185684"
},
{
"State": "كردستان",
"City": "قروه",
"phi": "35.16360092",
" lambda": "47.81004333"
},
{
"State": "كردستان",
"City": "كامياران",
"phi": "34.79716873",
" lambda": "46.93946457"
},
{
"State": "كردستان",
"City": "كاني دينار",
"phi": "35.46753311",
" lambda": "46.20333862"
},
{
"State": "كردستان",
"City": "كاني سور",
"phi": "36.05905914",
" lambda": "45.74882126"
},
{
"State": "كردستان",
"City": "مريوان",
"phi": "35.51787186",
" lambda": "46.18096924"
},
{
"State": "كردستان",
"City": "موچش",
"phi": "35.05914307",
" lambda": "47.15448761"
},
{
"State": "كردستان",
"City": "ياسوكند",
"phi": "36.28339386",
" lambda": "47.74681473"
},
{
"State": "كرمان",
"City": "اختيارآباد",
"phi": "30.31972313",
" lambda": "56.91827774"
},
{
"State": "كرمان",
"City": "ارزوئيه",
"phi": "28.45792961",
" lambda": "56.36352539"
},
{
"State": "كرمان",
"City": "امين شهر",
"phi": "30.8438282",
" lambda": "55.33936691"
},
{
"State": "كرمان",
"City": "انار",
"phi": "30.87254906",
" lambda": "55.27162933"
},
{
"State": "كرمان",
"City": "اندوهجرد",
"phi": "30.23103142",
" lambda": "57.75406265"
},
{
"State": "كرمان",
"City": "باغين",
"phi": "30.18938255",
" lambda": "56.81322479"
},
{
"State": "كرمان",
"City": "بافت",
"phi": "29.23217583",
" lambda": "56.59699249"
},
{
"State": "كرمان",
"City": "بردسير",
"phi": "29.92410088",
" lambda": "56.57876968"
},
{
"State": "كرمان",
"City": "بروات",
"phi": "29.04700661",
" lambda": "58.40858841"
},
{
"State": "كرمان",
"City": "بزنجان",
"phi": "29.25483513",
" lambda": "56.69428253"
},
{
"State": "كرمان",
"City": "بم",
"phi": "29.06779861",
" lambda": "58.34861755"
},
{
"State": "كرمان",
"City": "بهرمان",
"phi": "30.90431786",
" lambda": "55.72738647"
},
{
"State": "كرمان",
"City": "پاريز",
"phi": "29.87262154",
" lambda": "55.75054169"
},
{
"State": "كرمان",
"City": "جبالبارز",
"phi": "28.90602112",
" lambda": "57.88274765"
},
{
"State": "كرمان",
"City": "جوپار",
"phi": "30.05652428",
" lambda": "57.11240387"
},
{
"State": "كرمان",
"City": "جوزم",
"phi": "30.51511955",
" lambda": "55.03173447"
},
{
"State": "كرمان",
"City": "جيرفت",
"phi": "28.68039322",
" lambda": "57.74197388"
},
{
"State": "كرمان",
"City": "چترود",
"phi": "30.60101891",
" lambda": "56.90916824"
},
{
"State": "كرمان",
"City": "خاتون آباد",
"phi": "29.9971447",
" lambda": "55.41994476"
},
{
"State": "كرمان",
"City": "خانوك",
"phi": "30.71772003",
" lambda": "56.77554321"
},
{
"State": "كرمان",
"City": "خورسند",
"phi": "30.15340042",
" lambda": "55.08758163"
},
{
"State": "كرمان",
"City": "درب بهشت",
"phi": "29.23355484",
" lambda": "57.33667374"
},
{
"State": "كرمان",
"City": "دوساري",
"phi": "28.42318916",
" lambda": "57.9446907"
},
{
"State": "كرمان",
"City": "دهج",
"phi": "30.68716621",
" lambda": "54.87817764"
},
{
"State": "كرمان",
"City": "رابر",
"phi": "29.28990936",
" lambda": "56.91295624"
},
{
"State": "كرمان",
"City": "راور",
"phi": "31.24226189",
" lambda": "56.79842377"
},
{
"State": "كرمان",
"City": "راين",
"phi": "29.59888077",
" lambda": "57.43511581"
},
{
"State": "كرمان",
"City": "رفسنجان",
"phi": "30.37527657",
" lambda": "55.98764801"
},
{
"State": "كرمان",
"City": "رودبار",
"phi": "28.0208168",
" lambda": "57.99457932"
},
{
"State": "كرمان",
"City": "ريحان شهر",
"phi": "30.75133705",
" lambda": "56.73608017"
},
{
"State": "كرمان",
"City": "زرند",
"phi": "30.81172752",
" lambda": "56.55187225"
},
{
"State": "كرمان",
"City": "زنگي آباد",
"phi": "30.41259766",
" lambda": "56.91473389"
},
{
"State": "كرمان",
"City": "زيدآباد",
"phi": "29.59856987",
" lambda": "55.53490829"
},
{
"State": "كرمان",
"City": "سرچشمه",
"phi": "29.99733734",
" lambda": "55.79472351"
},
{
"State": "كرمان",
"City": "سيرجان",
"phi": "29.43761635",
" lambda": "55.67490768"
},
{
"State": "كرمان",
"City": "شهداد",
"phi": "30.41668129",
" lambda": "57.70170975"
},
{
"State": "كرمان",
"City": "شهربابك",
"phi": "30.11832619",
" lambda": "55.12078857"
},
{
"State": "كرمان",
"City": "صفائيه",
"phi": "30.82782364",
" lambda": "55.81137848"
},
{
"State": "كرمان",
"City": "عنبرآباد",
"phi": "28.47891808",
" lambda": "57.84252548"
},
{
"State": "كرمان",
"City": "فارياب",
"phi": "28.09708405",
" lambda": "57.22827911"
},
{
"State": "كرمان",
"City": "فهرج",
"phi": "28.94784355",
" lambda": "58.88511276"
},
{
"State": "كرمان",
"City": "قلعه گنج",
"phi": "27.51635361",
" lambda": "57.8829689"
},
{
"State": "كرمان",
"City": "كاظم آباد",
"phi": "30.56055641",
" lambda": "56.84365845"
},
{
"State": "كرمان",
"City": "كرمان",
"phi": "30.28140259",
" lambda": "57.06418228"
},
{
"State": "كرمان",
"City": "كشكوئيه",
"phi": "30.5305233",
" lambda": "55.64461899"
},
{
"State": "كرمان",
"City": "كوهبنان",
"phi": "31.41319847",
" lambda": "56.27933502"
},
{
"State": "كرمان",
"City": "كهنوج",
"phi": "27.92245483",
" lambda": "57.69707489"
},
{
"State": "كرمان",
"City": "كيانشهر",
"phi": "31.15600395",
" lambda": "56.38111115"
},
{
"State": "كرمان",
"City": "گلباف",
"phi": "29.88442039",
" lambda": "57.73108673"
},
{
"State": "كرمان",
"City": "گلزار",
"phi": "29.7112484",
" lambda": "57.04011154"
},
{
"State": "كرمان",
"City": "لاله زار",
"phi": "29.52295113",
" lambda": "56.81635284"
},
{
"State": "كرمان",
"City": "ماهان",
"phi": "30.05790901",
" lambda": "57.28974533"
},
{
"State": "كرمان",
"City": "محمد آباد ",
"phi": "28.64166832",
" lambda": "59.0174675"
},
{
"State": "كرمان",
"City": "محي آباد",
"phi": "30.07167435",
" lambda": "57.23011017"
},
{
"State": "كرمان",
"City": "مردهك",
"phi": "28.34990883",
" lambda": "58.15991974"
},
{
"State": "كرمان",
"City": "منوجان",
"phi": "27.40366745",
" lambda": "57.49675751"
},
{
"State": "كرمان",
"City": "نجف شهر",
"phi": "29.39123344",
" lambda": "55.72056961"
},
{
"State": "كرمان",
"City": "نرماشير",
"phi": "28.95152855",
" lambda": "58.69940567"
},
{
"State": "كرمان",
"City": "نظام شهر",
"phi": "28.91307068",
" lambda": "58.55143356"
},
{
"State": "كرمان",
"City": "نگار",
"phi": "29.85721779",
" lambda": "56.80291748"
},
{
"State": "كرمان",
"City": "نودژ",
"phi": "27.52715683",
" lambda": "57.44942474"
},
{
"State": "كرمان",
"City": "هجدك",
"phi": "30.75760651",
" lambda": "56.99620438"
},
{
"State": "كرمان",
"City": "هماشهر ",
"phi": "29.6626358",
" lambda": "55.80966568"
},
{
"State": "كرمان",
"City": "يزدان شهر",
"phi": "30.8664341",
" lambda": "56.37589264"
},
{
"State": "كرمانشاه",
"City": "ازگله",
"phi": "34.83340073",
" lambda": "45.84191895"
},
{
"State": "كرمانشاه",
"City": "اسلام آبادغرب",
"phi": "34.10961533",
" lambda": "46.52056885"
},
{
"State": "كرمانشاه",
"City": "باينگان",
"phi": "34.98140717",
" lambda": "46.27041245"
},
{
"State": "كرمانشاه",
"City": "بيستون",
"phi": "34.39458466",
" lambda": "47.44768524"
},
{
"State": "كرمانشاه",
"City": "پاوه",
"phi": "35.02669144",
" lambda": "46.36696625"
},
{
"State": "كرمانشاه",
"City": "تازه آباد",
"phi": "34.73862076",
" lambda": "46.15161514"
},
{
"State": "كرمانشاه",
"City": "جوانرود",
"phi": "34.80616379",
" lambda": "46.49219131"
},
{
"State": "كرمانشاه",
"City": "حميل",
"phi": "33.93801117",
" lambda": "46.7728653"
},
{
"State": "كرمانشاه",
"City": "رباط",
"phi": "34.26859283",
" lambda": "46.80641174"
},
{
"State": "كرمانشاه",
"City": "روانسر",
"phi": "34.71617889",
" lambda": "46.65607071"
},
{
"State": "كرمانشاه",
"City": "سرپل ذهاب",
"phi": "34.44868088",
" lambda": "45.86302567"
},
{
"State": "كرمانشاه",
"City": "سرمست",
"phi": "34.02695465",
" lambda": "46.33175278"
},
{
"State": "كرمانشاه",
"City": "سطر",
"phi": "34.81338882",
" lambda": "47.46087646"
},
{
"State": "كرمانشاه",
"City": "سنقر",
"phi": "34.76270676",
" lambda": "47.59963226"
},
{
"State": "كرمانشاه",
"City": "سومار",
"phi": "33.86553574",
" lambda": "45.64097214"
},
{
"State": "كرمانشاه",
"City": "شاهو",
"phi": "34.93078995",
" lambda": "46.46110916"
},
{
"State": "كرمانشاه",
"City": "صحنه",
"phi": "34.47551727",
" lambda": "47.68521881"
},
{
"State": "كرمانشاه",
"City": "قصرشيرين",
"phi": "34.50753021",
" lambda": "45.58929062"
},
{
"State": "كرمانشاه",
"City": "كرمانشاه",
"phi": "34.31409454",
" lambda": "47.09714127"
},
{
"State": "كرمانشاه",
"City": "كرندغرب",
"phi": "34.2787056",
" lambda": "46.23203659"
},
{
"State": "كرمانشاه",
"City": "كنگاور",
"phi": "34.50166702",
" lambda": "47.96202087"
},
{
"State": "كرمانشاه",
"City": "كوزران",
"phi": "34.49576187",
" lambda": "46.60207367"
},
{
"State": "كرمانشاه",
"City": "گهواره",
"phi": "34.34408188",
" lambda": "46.41585922"
},
{
"State": "كرمانشاه",
"City": "گيلانغرب",
"phi": "34.14031982",
" lambda": "45.92476654"
},
{
"State": "كرمانشاه",
"City": "ميان راهان",
"phi": "34.58388138",
" lambda": "47.44466782"
},
{
"State": "كرمانشاه",
"City": "نودشه",
"phi": "35.18050385",
" lambda": "46.25340652"
},
{
"State": "كرمانشاه",
"City": "نوسود",
"phi": "35.15751266",
" lambda": "46.20653915"
},
{
"State": "كرمانشاه",
"City": "هرسين",
"phi": "34.27000427",
" lambda": "47.58037567"
},
{
"State": "كرمانشاه",
"City": "هلشي",
"phi": "34.1101532",
" lambda": "47.09043121"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "باشت",
"phi": "30.3621273",
" lambda": "51.15632629"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "پاتاوه",
"phi": "30.95257187",
" lambda": "51.27075195"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "چرام",
"phi": "30.75547218",
" lambda": "50.74684143"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "چيتاب",
"phi": "30.79491806",
" lambda": "51.32473755"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "دوگنبدان",
"phi": "30.36346245",
" lambda": "50.78301239"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "دهدشت",
"phi": "30.79521179",
" lambda": "50.56335068"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "ديشموك",
"phi": "31.29852295",
" lambda": "50.40176773"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "سوق",
"phi": "30.85565186",
" lambda": "50.45983887"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "سي سخت",
"phi": "30.85756493",
" lambda": "51.45872879"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "قلعه رئيسي",
"phi": "31.19034767",
" lambda": "50.44401169"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "گراب سفلي",
"phi": "30.94458199",
" lambda": "50.89936829"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "لنده",
"phi": "30.98266792",
" lambda": "50.41968918"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "ليكك",
"phi": "30.89718437",
" lambda": "50.09283447"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "مادوان",
"phi": "30.71214867",
" lambda": "51.55456543"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "مارگون",
"phi": "30.99334145",
" lambda": "51.07814026"
},
{
"State": "كهگيلويه وبويراحمد",
"City": "ياسوج",
"phi": "30.65676308",
" lambda": "51.58242416"
},
{
"State": "گلستان",
"City": "انبارآلوم",
"phi": "37.13272476",
" lambda": "54.61863327"
},
{
"State": "گلستان",
"City": "اينچه برون",
"phi": "37.45383453",
" lambda": "54.71900177"
},
{
"State": "گلستان",
"City": "آزادشهر",
"phi": "37.08663177",
" lambda": "55.16947937"
},
{
"State": "گلستان",
"City": "آق قلا",
"phi": "37.00954056",
" lambda": "54.45674515"
},
{
"State": "گلستان",
"City": "بندرگز",
"phi": "36.75405884",
" lambda": "53.95071411"
},
{
"State": "گلستان",
"City": "تركمن",
"phi": "36.90301132",
" lambda": "54.07501984"
},
{
"State": "گلستان",
"City": "جلين",
"phi": "36.85464478",
" lambda": "54.53674316"
},
{
"State": "گلستان",
"City": "خان ببين",
"phi": "37.01268005",
" lambda": "54.98781586"
},
{
"State": "گلستان",
"City": "دلند",
"phi": "37.0352478",
" lambda": "55.04225922"
},
{
"State": "گلستان",
"City": "راميان",
"phi": "37.01845169",
" lambda": "55.1420784"
},
{
"State": "گلستان",
"City": "سرخنكلاته",
"phi": "36.88298035",
" lambda": "54.56939316"
},
{
"State": "گلستان",
"City": "سيمين شهر",
"phi": "37.01129913",
" lambda": "54.23209"
},
{
"State": "گلستان",
"City": "علي آباد",
"phi": "36.91240311",
" lambda": "54.85770035"
},
{
"State": "گلستان",
"City": "فاضل آباد",
"phi": "36.89946747",
" lambda": "54.75127029"
},
{
"State": "گلستان",
"City": "كردكوي",
"phi": "36.79452515",
" lambda": "54.10991669"
},
{
"State": "گلستان",
"City": "كلاله",
"phi": "37.38112259",
" lambda": "55.4916153"
},
{
"State": "گلستان",
"City": "گاليكش",
"phi": "37.27040482",
" lambda": "55.43107224"
},
{
"State": "گلستان",
"City": "گرگان",
"phi": "36.84519958",
" lambda": "54.42879868"
},
{
"State": "گلستان",
"City": "گميش تپه",
"phi": "37.07165909",
" lambda": "54.07542038"
},
{
"State": "گلستان",
"City": "گنبد كاووس",
"phi": "37.24781418",
" lambda": "55.17573929"
},
{
"State": "گلستان",
"City": "مراوه تپه",
"phi": "37.90470886",
" lambda": "55.96172714"
},
{
"State": "گلستان",
"City": "مينودشت",
"phi": "37.22966003",
" lambda": "55.37508774"
},
{
"State": "گلستان",
"City": "نگين شهر",
"phi": "37.13905716",
" lambda": "55.16414642"
},
{
"State": "گلستان",
"City": "نوده خاندوز",
"phi": "37.07626724",
" lambda": "55.26222229"
},
{
"State": "گلستان",
"City": "نوكنده",
"phi": "36.73976517",
" lambda": "53.91312027"
},
{
"State": "گيلان",
"City": "احمدسرگوراب",
"phi": "37.13359833",
" lambda": "49.36792755"
},
{
"State": "گيلان",
"City": "اسالم",
"phi": "37.73570251",
" lambda": "48.94587326"
},
{
"State": "گيلان",
"City": "اطاقور",
"phi": "37.11016846",
" lambda": "50.11386871"
},
{
"State": "گيلان",
"City": "املش",
"phi": "37.08721161",
" lambda": "50.19102859"
},
{
"State": "گيلان",
"City": "آستارا",
"phi": "38.38718033",
" lambda": "48.86924744"
},
{
"State": "گيلان",
"City": "آستانه اشرفيه",
"phi": "37.26359177",
" lambda": "49.94490814"
},
{
"State": "گيلان",
"City": "بازارجمعه",
"phi": "37.40681839",
" lambda": "49.11826706"
},
{
"State": "گيلان",
"City": "بره سر",
"phi": "36.77672577",
" lambda": "49.75241089"
},
{
"State": "گيلان",
"City": "بندرانزلي",
"phi": "37.46670532",
" lambda": "49.46269989"
},
{
"State": "گيلان",
"City": "پره سر",
"phi": "37.6034317",
" lambda": "49.06938171"
},
{
"State": "گيلان",
"City": "توتكابن",
"phi": "36.89390945",
" lambda": "49.5256691"
},
{
"State": "گيلان",
"City": "جيرنده",
"phi": "36.70132828",
" lambda": "49.79056168"
},
{
"State": "گيلان",
"City": "چابكسر",
"phi": "36.97463989",
" lambda": "50.55472183"
},
{
"State": "گيلان",
"City": "چاف وچمخاله",
"phi": "37.216465",
" lambda": "50.22565842"
},
{
"State": "گيلان",
"City": "چوبر",
"phi": "37.08962631",
" lambda": "49.42182541"
},
{
"State": "گيلان",
"City": "حويق",
"phi": "38.15422058",
" lambda": "48.89034653"
},
{
"State": "گيلان",
"City": "خشكبيجار",
"phi": "37.37414551",
" lambda": "49.75869751"
},
{
"State": "گيلان",
"City": "خمام",
"phi": "37.38215256",
" lambda": "49.65184402"
},
{
"State": "گيلان",
"City": "ديلمان",
"phi": "36.88354111",
" lambda": "49.90714264"
},
{
"State": "گيلان",
"City": "رانكوه",
"phi": "37.04977417",
" lambda": "50.23648453"
},
{
"State": "گيلان",
"City": "رحيم آباد",
"phi": "37.03316498",
" lambda": "50.33705139"
},
{
"State": "گيلان",
"City": "رستم آباد",
"phi": "36.88407135",
" lambda": "49.49157333"
},
{
"State": "گيلان",
"City": "رشت",
"phi": "37.28414536",
" lambda": "49.59040833"
},
{
"State": "گيلان",
"City": "رضوانشهر ",
"phi": "37.55055618",
" lambda": "49.13970184"
},
{
"State": "گيلان",
"City": "رودبار ",
"phi": "36.8066597",
" lambda": "49.41897583"
},
{
"State": "گيلان",
"City": "رودبنه",
"phi": "37.2565918",
" lambda": "50.00820541"
},
{
"State": "گيلان",
"City": "رودسر",
"phi": "37.13264847",
" lambda": "50.30025482"
},
{
"State": "گيلان",
"City": "سنگر",
"phi": "37.179142",
" lambda": "49.69771576"
},
{
"State": "گيلان",
"City": "سياهكل",
"phi": "37.15109253",
" lambda": "49.87237167"
},
{
"State": "گيلان",
"City": "شفت",
"phi": "37.16381454",
" lambda": "49.40309143"
},
{
"State": "گيلان",
"City": "شلمان",
"phi": "37.15990067",
" lambda": "50.21665192"
},
{
"State": "گيلان",
"City": "صومعه سرا",
"phi": "37.30283356",
" lambda": "49.32012177"
},
{
"State": "گيلان",
"City": "فومن",
"phi": "37.22570038",
" lambda": "49.31100082"
},
{
"State": "گيلان",
"City": "كلاچاي",
"phi": "37.07468033",
" lambda": "50.39940262"
},
{
"State": "گيلان",
"City": "كوچصفهان",
"phi": "37.27716446",
" lambda": "49.76813889"
},
{
"State": "گيلان",
"City": "كومله",
"phi": "37.15062714",
" lambda": "50.17618179"
},
{
"State": "گيلان",
"City": "كياشهر",
"phi": "37.42233658",
" lambda": "49.93053436"
},
{
"State": "گيلان",
"City": "گوراب زرميخ",
"phi": "37.30015945",
" lambda": "49.21863174"
},
{
"State": "گيلان",
"City": "لاهيجان",
"phi": "37.20239258",
" lambda": "50.01081848"
},
{
"State": "گيلان",
"City": "لشت نشاء",
"phi": "37.36238861",
" lambda": "49.86184311"
},
{
"State": "گيلان",
"City": "لنگرود",
"phi": "37.1956749",
" lambda": "50.14742661"
},
{
"State": "گيلان",
"City": "لوشان",
"phi": "36.6312561",
" lambda": "49.51477051"
},
{
"State": "گيلان",
"City": "لولمان",
"phi": "37.25234985",
" lambda": "49.82508469"
},
{
"State": "گيلان",
"City": "لوندويل",
"phi": "38.30926895",
" lambda": "48.86349106"
},
{
"State": "گيلان",
"City": "ليسار",
"phi": "37.93748856",
" lambda": "48.91623688"
},
{
"State": "گيلان",
"City": "ماسال",
"phi": "37.3655014",
" lambda": "49.13176727"
},
{
"State": "گيلان",
"City": "ماسوله",
"phi": "37.15603638",
" lambda": "48.98937988"
},
{
"State": "گيلان",
"City": "مرجقل",
"phi": "37.28359985",
" lambda": "49.37948608"
},
{
"State": "گيلان",
"City": "منجيل",
"phi": "36.74129868",
" lambda": "49.41854095"
},
{
"State": "گيلان",
"City": "واجارگاه",
"phi": "37.04175186",
" lambda": "50.41373825"
},
{
"State": "گيلان",
"City": "هشتپر",
"phi": "37.79555893",
" lambda": "48.9043808"
},
{
"State": "لرستان",
"City": "ازنا",
"phi": "33.4573288",
" lambda": "49.45421219"
},
{
"State": "لرستان",
"City": "اشترينان",
"phi": "34.01740646",
" lambda": "48.64218521"
},
{
"State": "لرستان",
"City": "الشتر",
"phi": "33.86140823",
" lambda": "48.25976563"
},
{
"State": "لرستان",
"City": "اليگودرز",
"phi": "33.40154648",
" lambda": "49.69316864"
},
{
"State": "لرستان",
"City": "بروجرد",
"phi": "33.89829254",
" lambda": "48.75468063"
},
{
"State": "لرستان",
"City": "پلدختر",
"phi": "33.1529274",
" lambda": "47.71431732"
},
{
"State": "لرستان",
"City": "چالانچولان",
"phi": "33.66461563",
" lambda": "48.90665817"
},
{
"State": "لرستان",
"City": "چغلوندي",
"phi": "33.64917374",
" lambda": "48.55954361"
},
{
"State": "لرستان",
"City": "چقابل",
"phi": "33.28184891",
" lambda": "47.50801849"
},
{
"State": "لرستان",
"City": "خرم آباد",
"phi": "33.45696259",
" lambda": "48.34891129"
},
{
"State": "لرستان",
"City": "درب گنبد",
"phi": "33.69076157",
" lambda": "47.14829636"
},
{
"State": "لرستان",
"City": "دورود",
"phi": "33.49420166",
" lambda": "49.05680847"
},
{
"State": "لرستان",
"City": "زاغه",
"phi": "33.49572754",
" lambda": "48.70754623"
},
{
"State": "لرستان",
"City": "سپيددشت",
"phi": "33.21977615",
" lambda": "48.88391113"
},
{
"State": "لرستان",
"City": "سراب دوره",
"phi": "33.56311035",
" lambda": "48.02005386"
},
{
"State": "لرستان",
"City": "شول آباد",
"phi": "33.18558884",
" lambda": "49.19091034"
},
{
"State": "لرستان",
"City": "فيروز آباد",
"phi": "33.89903259",
" lambda": "48.10310745"
},
{
"State": "لرستان",
"City": "كوناني",
"phi": "33.40246964",
" lambda": "47.32543945"
},
{
"State": "لرستان",
"City": "كوهدشت",
"phi": "33.53415298",
" lambda": "47.60846329"
},
{
"State": "لرستان",
"City": "گراب",
"phi": "33.47413635",
" lambda": "47.23699951"
},
{
"State": "لرستان",
"City": "معمولان",
"phi": "33.37940979",
" lambda": "47.96188354"
},
{
"State": "لرستان",
"City": "مؤمن آباد",
"phi": "33.58478546",
" lambda": "49.51848221"
},
{
"State": "لرستان",
"City": "نور آباد",
"phi": "34.07039642",
" lambda": "47.97319412"
},
{
"State": "لرستان",
"City": "ويسيان",
"phi": "33.48619843",
" lambda": "48.03033829"
},
{
"State": "لرستان",
"City": "هفت چشمه",
"phi": "34.20405579",
" lambda": "47.75966263"
},
{
"State": "مازندران",
"City": "اميركلا",
"phi": "36.59878159",
" lambda": "52.6627388"
},
{
"State": "مازندران",
"City": "ايزدشهر",
"phi": "36.60129166",
" lambda": "52.13937759"
},
{
"State": "مازندران",
"City": "آلاشت",
"phi": "36.06636047",
" lambda": "52.83791351"
},
{
"State": "مازندران",
"City": "آمل",
"phi": "36.47745514",
" lambda": "52.35583496"
},
{
"State": "مازندران",
"City": "بابل",
"phi": "36.52119446",
" lambda": "52.67593002"
},
{
"State": "مازندران",
"City": "بابلسر",
"phi": "36.69893646",
" lambda": "52.64933777"
},
{
"State": "مازندران",
"City": "بلده",
"phi": "36.20122147",
" lambda": "51.80610275"
},
{
"State": "مازندران",
"City": "بهشهر",
"phi": "36.69554138",
" lambda": "53.53464127"
},
{
"State": "مازندران",
"City": "بهنمير",
"phi": "36.67020416",
" lambda": "52.7622757"
},
{
"State": "مازندران",
"City": "پل سفيد",
"phi": "36.11366653",
" lambda": "53.0577507"
},
{
"State": "مازندران",
"City": "پول",
"phi": "36.39558029",
" lambda": "51.58979416"
},
{
"State": "مازندران",
"City": "تنكابن",
"phi": "36.81513977",
" lambda": "50.87436295"
},
{
"State": "مازندران",
"City": "جويبار",
"phi": "36.64100647",
" lambda": "52.89982605"
},
{
"State": "مازندران",
"City": "چالوس",
"phi": "36.65398788",
" lambda": "51.42446899"
},
{
"State": "مازندران",
"City": "چمستان",
"phi": "36.48239899",
" lambda": "52.1211319"
},
{
"State": "مازندران",
"City": "خرم آباد ",
"phi": "36.7863121",
" lambda": "50.86737442"
},
{
"State": "مازندران",
"City": "خليل شهر",
"phi": "36.70176315",
" lambda": "53.63957214"
},
{
"State": "مازندران",
"City": "خوش رودپي",
"phi": "36.37145996",
" lambda": "52.5656929"
},
{
"State": "مازندران",
"City": "دابودشت",
"phi": "36.4806633",
" lambda": "52.45203781"
},
{
"State": "مازندران",
"City": "رامسر",
"phi": "36.91598892",
" lambda": "50.66233444"
},
{
"State": "مازندران",
"City": "رستمكلا",
"phi": "36.67808151",
" lambda": "53.42604446"
},
{
"State": "مازندران",
"City": "رويان",
"phi": "36.57036591",
" lambda": "51.96886063"
},
{
"State": "مازندران",
"City": "رينه",
"phi": "35.88198853",
" lambda": "52.16975021"
},
{
"State": "مازندران",
"City": "زرگر محله",
"phi": "36.51618576",
" lambda": "52.5744133"
},
{
"State": "مازندران",
"City": "زيرآب",
"phi": "36.17964172",
" lambda": "52.97468567"
},
{
"State": "مازندران",
"City": "ساري",
"phi": "36.56688309",
" lambda": "53.06001663"
},
{
"State": "مازندران",
"City": "سرخرود",
"phi": "36.67657471",
" lambda": "52.45679092"
},
{
"State": "مازندران",
"City": "سلمان شهر",
"phi": "36.6990242",
" lambda": "51.19995499"
},
{
"State": "مازندران",
"City": "سورك",
"phi": "36.59392166",
" lambda": "53.21167374"
},
{
"State": "مازندران",
"City": "شيرگاه",
"phi": "36.28995132",
" lambda": "52.88095093"
},
{
"State": "مازندران",
"City": "شيرود",
"phi": "36.84794998",
" lambda": "50.79053116"
},
{
"State": "مازندران",
"City": "عباس آباد",
"phi": "36.72123337",
" lambda": "51.11597061"
},
{
"State": "مازندران",
"City": "فريدونكنار",
"phi": "36.68280411",
" lambda": "52.51668549"
},
{
"State": "مازندران",
"City": "فريم",
"phi": "36.17418671",
" lambda": "53.266922"
},
{
"State": "مازندران",
"City": "قائم شهر",
"phi": "36.46435165",
" lambda": "52.86508179"
},
{
"State": "مازندران",
"City": "كتالم وسادات شهر",
"phi": "36.8780632",
" lambda": "50.71697235"
},
{
"State": "مازندران",
"City": "كلارآباد",
"phi": "36.69142914",
" lambda": "51.26262665"
},
{
"State": "مازندران",
"City": "كلاردشت",
"phi": "36.49369431",
" lambda": "51.14495468"
},
{
"State": "مازندران",
"City": "كله بست",
"phi": "36.63523483",
" lambda": "52.62673569"
},
{
"State": "مازندران",
"City": "كوهي خيل",
"phi": "36.68581009",
" lambda": "52.90699005"
},
{
"State": "مازندران",
"City": "كياسر",
"phi": "36.23791504",
" lambda": "53.53940582"
},
{
"State": "مازندران",
"City": "كياكلا",
"phi": "36.58187485",
" lambda": "52.81481934"
},
{
"State": "مازندران",
"City": "گتاب",
"phi": "36.41659546",
" lambda": "52.65651321"
},
{
"State": "مازندران",
"City": "گزنك",
"phi": "35.90294266",
" lambda": "52.21924973"
},
{
"State": "مازندران",
"City": "گلوگاه",
"phi": "36.7251358",
" lambda": "53.81105042"
},
{
"State": "مازندران",
"City": "محمود آباد",
"phi": "36.63143921",
" lambda": "52.25236893"
},
{
"State": "مازندران",
"City": "مرزن آباد",
"phi": "36.44631577",
" lambda": "51.29559326"
},
{
"State": "مازندران",
"City": "مرزيكلا",
"phi": "36.364048",
" lambda": "52.73585129"
},
{
"State": "مازندران",
"City": "نشتارود",
"phi": "36.74822998",
" lambda": "51.03511047"
},
{
"State": "مازندران",
"City": "نكا",
"phi": "36.65187454",
" lambda": "53.29364777"
},
{
"State": "مازندران",
"City": "نور",
"phi": "36.57307434",
" lambda": "52.01588058"
},
{
"State": "مازندران",
"City": "نوشهر",
"phi": "36.64708328",
" lambda": "51.4998436"
},
{
"State": "مركزي",
"City": "اراك",
"phi": "34.09344864",
" lambda": "49.7220993"
},
{
"State": "مركزي",
"City": "آستانه",
"phi": "33.88845825",
" lambda": "49.35202026"
},
{
"State": "مركزي",
"City": "آشتيان",
"phi": "34.52359009",
" lambda": "50.00579453"
},
{
"State": "مركزي",
"City": "پرندك",
"phi": "35.35950851",
" lambda": "50.68057632"
},
{
"State": "مركزي",
"City": "تفرش",
"phi": "34.68502045",
" lambda": "50.02262878"
},
{
"State": "مركزي",
"City": "توره",
"phi": "34.0461235",
" lambda": "49.28879929"
},
{
"State": "مركزي",
"City": "جاورسيان",
"phi": "34.25661087",
" lambda": "49.32698822"
},
{
"State": "مركزي",
"City": "خشكرود",
"phi": "35.39956665",
" lambda": "50.33560562"
},
{
"State": "مركزي",
"City": "خمين",
"phi": "33.64107513",
" lambda": "50.08030701"
},
{
"State": "مركزي",
"City": "خنداب",
"phi": "34.38344955",
" lambda": "49.18894196"
},
{
"State": "مركزي",
"City": "داودآباد",
"phi": "34.29349136",
" lambda": "49.85509872"
},
{
"State": "مركزي",
"City": "دليجان",
"phi": "33.99035645",
" lambda": "50.68165588"
},
{
"State": "مركزي",
"City": "رازقان",
"phi": "35.33108902",
" lambda": "49.95592499"
},
{
"State": "مركزي",
"City": "زاويه",
"phi": "35.37210464",
" lambda": "50.57035446"
},
{
"State": "مركزي",
"City": "ساروق",
"phi": "34.40793228",
" lambda": "49.50768661"
},
{
"State": "مركزي",
"City": "ساوه",
"phi": "35.0253334",
" lambda": "50.36492157"
},
{
"State": "مركزي",
"City": "سنجان",
"phi": "34.05099869",
" lambda": "49.62426376"
},
{
"State": "مركزي",
"City": "شازند",
"phi": "33.93370056",
" lambda": "49.41087723"
},
{
"State": "مركزي",
"City": "شهرجديدمهاجران",
"phi": "34.05187988",
" lambda": "49.4342804"
},
{
"State": "مركزي",
"City": "غرق آباد",
"phi": "35.10105896",
" lambda": "49.83054352"
},
{
"State": "مركزي",
"City": "فرمهين",
"phi": "34.4960289",
" lambda": "49.68437195"
},
{
"State": "مركزي",
"City": "قورچي باشي",
"phi": "33.67477798",
" lambda": "49.87743378"
},
{
"State": "مركزي",
"City": "كرهرود",
"phi": "34.06370163",
" lambda": "49.65003586"
},
{
"State": "مركزي",
"City": "كميجان",
"phi": "34.71912384",
" lambda": "49.32233429"
},
{
"State": "مركزي",
"City": "مأمونيه",
"phi": "35.31093979",
" lambda": "50.4972496"
},
{
"State": "مركزي",
"City": "محلات",
"phi": "33.90838242",
" lambda": "50.45414352"
},
{
"State": "مركزي",
"City": "ميلاجرد",
"phi": "34.62127304",
" lambda": "49.20958328"
},
{
"State": "مركزي",
"City": "نراق",
"phi": "34.01171112",
" lambda": "50.83797073"
},
{
"State": "مركزي",
"City": "نوبران",
"phi": "35.12994385",
" lambda": "49.70922852"
},
{
"State": "مركزي",
"City": "نيمور",
"phi": "33.88691711",
" lambda": "50.57363129"
},
{
"State": "مركزي",
"City": "هندودر",
"phi": "33.77946091",
" lambda": "49.23086548"
},
{
"State": "هرمزگان",
"City": "ابوموسي",
"phi": "25.88346291",
" lambda": "55.02985382"
},
{
"State": "هرمزگان",
"City": "بستك",
"phi": "27.19461441",
" lambda": "54.36679459"
},
{
"State": "هرمزگان",
"City": "بندرجاسك",
"phi": "25.65699577",
" lambda": "57.80063248"
},
{
"State": "هرمزگان",
"City": "بندرچارك",
"phi": "26.73349762",
" lambda": "54.27341461"
},
{
"State": "هرمزگان",
"City": "بندرعباس",
"phi": "27.19265175",
" lambda": "56.29146576"
},
{
"State": "هرمزگان",
"City": "بندرلنگه",
"phi": "26.54753304",
" lambda": "54.88892365"
},
{
"State": "هرمزگان",
"City": "بيكاه",
"phi": "27.3489151",
" lambda": "57.1773262"
},
{
"State": "هرمزگان",
"City": "پارسيان",
"phi": "27.20393944",
" lambda": "53.04272461"
},
{
"State": "هرمزگان",
"City": "تخت",
"phi": "27.50037193",
" lambda": "56.63467789"
},
{
"State": "هرمزگان",
"City": "جناح",
"phi": "27.01815414",
" lambda": "54.28599548"
},
{
"State": "هرمزگان",
"City": "حاجي آباد  ",
"phi": "28.30921173",
" lambda": "55.90161896"
},
{
"State": "هرمزگان",
"City": "خمير",
"phi": "26.95120621",
" lambda": "55.58790207"
},
{
"State": "هرمزگان",
"City": "درگهان",
"phi": "26.96417618",
" lambda": "56.06622314"
},
{
"State": "هرمزگان",
"City": "دهبارز",
"phi": "27.44199562",
" lambda": "57.19750214"
},
{
"State": "هرمزگان",
"City": "رويدر",
"phi": "27.46556854",
" lambda": "55.41753769"
},
{
"State": "هرمزگان",
"City": "زيارتعلي",
"phi": "27.73999596",
" lambda": "57.22634125"
},
{
"State": "هرمزگان",
"City": "سردشت بشاگرد",
"phi": "26.45518494",
" lambda": "57.90121841"
},
{
"State": "هرمزگان",
"City": "سرگز",
"phi": "27.9431839",
" lambda": "56.65697861"
},
{
"State": "هرمزگان",
"City": "سندرك",
"phi": "26.83678436",
" lambda": "57.42654037"
},
{
"State": "هرمزگان",
"City": "سوزا",
"phi": "26.7803154",
" lambda": "56.06500244"
},
{
"State": "هرمزگان",
"City": "سيريك",
"phi": "26.52111053",
" lambda": "57.10928726"
},
{
"State": "هرمزگان",
"City": "فارغان",
"phi": "28.00914574",
" lambda": "56.25219727"
},
{
"State": "هرمزگان",
"City": "فين",
"phi": "27.6335907",
" lambda": "55.88210678"
},
{
"State": "هرمزگان",
"City": "قشم",
"phi": "26.94894218",
" lambda": "56.27288055"
},
{
"State": "هرمزگان",
"City": "قلعه قاضي",
"phi": "27.44466782",
" lambda": "56.54461288"
},
{
"State": "هرمزگان",
"City": "كنگ",
"phi": "26.59617996",
" lambda": "54.93657303"
},
{
"State": "هرمزگان",
"City": "كوشكنار",
"phi": "27.2517395",
" lambda": "52.86735916"
},
{
"State": "هرمزگان",
"City": "كيش",
"phi": "26.53342438",
" lambda": "53.97384644"
},
{
"State": "هرمزگان",
"City": "گوهران",
"phi": "26.59462738",
" lambda": "57.89758682"
},
{
"State": "هرمزگان",
"City": "ميناب",
"phi": "27.09758759",
" lambda": "57.07415009"
},
{
"State": "هرمزگان",
"City": "هرمز",
"phi": "27.09114075",
" lambda": "56.45739746"
},
{
"State": "هرمزگان",
"City": "هشتبندي",
"phi": "27.16456795",
" lambda": "57.45123672"
},
{
"State": "همدان",
"City": "ازندريان",
"phi": "34.50163269",
" lambda": "48.69296265"
},
{
"State": "همدان",
"City": "اسدآباد",
"phi": "34.78535843",
" lambda": "48.12166214"
},
{
"State": "همدان",
"City": "برزول",
"phi": "34.2135582",
" lambda": "48.26097107"
},
{
"State": "همدان",
"City": "بهار",
"phi": "34.89070511",
" lambda": "48.44088364"
},
{
"State": "همدان",
"City": "تويسركان",
"phi": "34.54904175",
" lambda": "48.4481163"
},
{
"State": "همدان",
"City": "جورقان",
"phi": "34.88180542",
" lambda": "48.55279922"
},
{
"State": "همدان",
"City": "جوكار",
"phi": "34.43160629",
" lambda": "48.68609619"
},
{
"State": "همدان",
"City": "دمق",
"phi": "35.43703461",
" lambda": "48.82205582"
},
{
"State": "همدان",
"City": "رزن",
"phi": "35.39064789",
" lambda": "49.03511429"
},
{
"State": "همدان",
"City": "زنگنه",
"phi": "34.15483856",
" lambda": "49.00841141"
},
{
"State": "همدان",
"City": "سامن",
"phi": "34.20925522",
" lambda": "48.70354462"
},
{
"State": "همدان",
"City": "سركان",
"phi": "34.59448242",
" lambda": "48.44788742"
},
{
"State": "همدان",
"City": "شيرين سو",
"phi": "35.49272537",
" lambda": "48.45061111"
},
{
"State": "همدان",
"City": "صالح آباد   ",
"phi": "34.92208862",
" lambda": "48.3430748"
},
{
"State": "همدان",
"City": "فامنين",
"phi": "35.11537552",
" lambda": "48.97226715"
},
{
"State": "همدان",
"City": "فرسفج",
"phi": "34.4860611",
" lambda": "48.28831863"
},
{
"State": "همدان",
"City": "فيروزان",
"phi": "34.36055756",
" lambda": "48.11615753"
},
{
"State": "همدان",
"City": "قروه در جزين",
"phi": "35.31196594",
" lambda": "49.10005188"
},
{
"State": "همدان",
"City": "قهاوند",
"phi": "34.85839462",
" lambda": "49.00336075"
},
{
"State": "همدان",
"City": "كبودرآهنگ",
"phi": "35.20924377",
" lambda": "48.72486877"
},
{
"State": "همدان",
"City": "گل تپه",
"phi": "35.22013855",
" lambda": "48.20539474"
},
{
"State": "همدان",
"City": "گيان",
"phi": "34.17702484",
" lambda": "48.24406815"
},
{
"State": "همدان",
"City": "لالجين",
"phi": "34.97359467",
" lambda": "48.47839737"
},
{
"State": "همدان",
"City": "مريانج",
"phi": "34.83189392",
" lambda": "48.46326828"
},
{
"State": "همدان",
"City": "ملاير",
"phi": "34.2973175",
" lambda": "48.81654739"
},
{
"State": "همدان",
"City": "نهاوند",
"phi": "34.16820908",
" lambda": "48.37550735"
},
{
"State": "همدان",
"City": "همدان",
"phi": "34.7918129",
" lambda": "48.52614594"
},
{
"State": "يزد",
"City": "ابركوه",
"phi": "31.13022423",
" lambda": "53.27944946"
},
{
"State": "يزد",
"City": "احمدآباد",
"phi": "32.35710526",
" lambda": "53.99137115"
},
{
"State": "يزد",
"City": "اردكان ",
"phi": "32.30692291",
" lambda": "54.01856232"
},
{
"State": "يزد",
"City": "اشكذر",
"phi": "32.00024414",
" lambda": "54.20687866"
},
{
"State": "يزد",
"City": "بافق",
"phi": "31.60409164",
" lambda": "55.39638138"
},
{
"State": "يزد",
"City": "بفروئيه",
"phi": "32.27230835",
" lambda": "53.99681091"
},
{
"State": "يزد",
"City": "بهاباد",
"phi": "31.86797905",
" lambda": "56.02648926"
},
{
"State": "يزد",
"City": "تفت",
"phi": "31.74265671",
" lambda": "54.20771408"
},
{
"State": "يزد",
"City": "حميديا",
"phi": "31.81936646",
" lambda": "54.39827728"
},
{
"State": "يزد",
"City": "خضرآباد",
"phi": "31.86546516",
" lambda": "53.95237732"
},
{
"State": "يزد",
"City": "ديهوك",
"phi": "33.28034973",
" lambda": "57.51596832"
},
{
"State": "يزد",
"City": "زارچ",
"phi": "31.98426628",
" lambda": "54.24261475"
},
{
"State": "يزد",
"City": "شاهديه",
"phi": "31.94301033",
" lambda": "54.28015518"
},
{
"State": "يزد",
"City": "طبس",
"phi": "33.57518768",
" lambda": "56.93533325"
},
{
"State": "يزد",
"City": "عشق آباد ",
"phi": "34.3663559",
" lambda": "56.92831802"
},
{
"State": "يزد",
"City": "عقدا",
"phi": "32.4395256",
" lambda": "53.63165665"
},
{
"State": "يزد",
"City": "مروست",
"phi": "30.46538544",
" lambda": "54.21076965"
},
{
"State": "يزد",
"City": "مهردشت",
"phi": "31.02316475",
" lambda": "53.35573578"
},
{
"State": "يزد",
"City": "مهريز",
"phi": "31.55741882",
" lambda": "54.43781662"
},
{
"State": "يزد",
"City": "ميبد",
"phi": "32.24225235",
" lambda": "54.0181427"
},
{
"State": "يزد",
"City": "ندوشن",
"phi": "32.02905273",
" lambda": "53.54851532"
},
{
"State": "يزد",
"City": "نير ",
"phi": "31.48485947",
" lambda": "54.12881851"
},
{
"State": "يزد",
"City": "هرات",
"phi": "30.05081558",
" lambda": "54.36970139"
},
{
"State": "يزد",
"City": "يزد",
"phi": "31.88352203",
" lambda": "54.34774017"
}
]''';
